[
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/rockville-job-based-it-qa-selenium/6852244534.html",
        "title": "Job-Based IT QA & Selenium Webdriver Training (MD/VA/DC) (Rockville)",
        "date": "2019-03-28 05:25",
        "description": [
            "\n        ",
            "\nContact Us:",
            "\nCell: (443)603-3985 [Text/Whatsapp Welcome]",
            "\nOffice: (301)200-5008",
            "\n",
            "\n**Live Agile Projects** to get you work Experience as a Quality Assurance Analyst",
            "\n",
            "\nVisit Us: www.itechsolutionsinc.com",
            "\nAddress 11140 Rockville Pike Suite 400 Rockville MD 20852",
            "\n",
            "\n**100% Students are in jobs - till date** *Making between 60k to 80k per year*",
            "\n",
            "\nWe are not a staffing company. We do not make you sign a contract for a year like other companies or take a cut out of your salary for a year.",
            "\nWe have a fee which is payable in installments during the training period. We support you till you get a job.",
            "\n",
            "\nUPCOMING CLASS SCHEDULES: Software Quality Assurance Manual and Automation(Selenium) Training",
            "\nWEEKENDS: 16 Weeks",
            "\n2PM - 5PM - Apr 06",
            "\n",
            "\nUPCOMING CLASS SCHEDULES: Selenium Webdriver Automation Tool Training",
            "\nWEEKDAYS: (Wed and Thur)12 Weeks",
            "\n6.30-9.30 P.M - Mar27th",
            "\n",
            "\n** Register for the class by making a deposit $200 as the classes fill in very fast**",
            "\n",
            "\n**MEET THE TRAINER @ 1pm or 8pm ANY WEEKEND or after 6 PM on WEEKDAYS in Rockville**",
            "\nPlease call or text before you plan to come to meet the trainer and set up an appointment",
            "\n",
            "\nPlease bring along a Laptop",
            "\nPlease call when you reach, we will have to let you in the building.",
            "\n****You can attend the classes online****",
            "\n",
            "\n17+ yrs of IT QA Experience is your Trainer!!",
            "\n",
            "\nWho is it for??",
            "\n*****Motivated and Determined Folks Who Want To Make IT Their Career******",
            "\nUNDER-GRADS, GRADS(Any field || Any Year!!)",
            "\nand",
            "\nWORKING NON-IT AND IT PROFESSIONALS!!!",
            "\n",
            "\nFEATURING",
            "\nIntroduction to QA. What is Quality Assurance Testing?",
            "\nIntroduction to Software Development Life Cycle (SDLC)",
            "\nTesting Methodologies (Waterfall and Agile)",
            "\nQA Processes",
            "\nHow to Test Web Based, Client Server Applications, Mobile Applications",
            "\nWriting Robust Test Scenarios and TestCases",
            "\nTools for Writing Test Cases (Quality Center, Test Rail)",
            "\nHow to write Test Cases from Requirements and Design Documents",
            "\nRequirement Traceability Matrix (RTM)",
            "\nHow to Log Defects/Bugs",
            "\nBug Logging and Tracking Tools (JIRA, ALM, ClearQuest)",
            "\nExpertise on Different Kinds of Testing (Smoke, Functional, System, Integration, Performance, Alpha, Beta, Regression)",
            "\n***JIRA AGILE***",
            "\nHands on Experience in Testing Live Projects",
            "\nDatabase-Writing SQL Queries to Perform Back-end Testing",
            "\nWriting Complete Test Plans",
            "\nHow to look at LogFiles to Determine Errors and Software Bugs",
            "\nA typical day in the life of a QA Engineer during different stages of SDLC",
            "\nDomain Expertise:Mobile Device Management(MDM) and Mobile Service Management(MSM), Mortgage Industry",
            "\n***Selenium WebDriver Automation Testing***",
            "\nAutomation Tool - Tosca",
            "\nWeb Services Testing using Soap UI,Postman",
            "\nBasic Unix Commands for Testing",
            "\nJob Interview Training",
            "\nResume Prep",
            "\nMock Interviews",
            "\nPlacement Guidance",
            "\nInterview Support",
            "\nReferences    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/herndon-kickass-4n6-dev-us-citizens/6847965763.html",
        "title": "[Kickass] 4N6 Dev (US citizens only, no telecommuters)",
        "date": "2019-03-22 17:15",
        "description": [
            "\n        ",
            "\nWe are seeking a motivated software developer to work with us on a digital forensic project. We're interested in your ability to learn new things and apply your intellect to solve difficult problems, experience with specific programming languages and technologies are less important. In this national security position you will leverage your technical skills to keep people safe and make a difference in the world.  You will: ",
            "\n",
            "\nWork on a small team to research & develop digital forensic tools",
            "\nCreate novel data visualization techniques for displaying raw data",
            "\nDevelop new techniques for recovering data from computers and mobile devices ",
            "\nCollaborate regularly with customer to implement new functionality",
            "\n",
            "\nWe require: ",
            "\nB.S. in Computer Science (or related degree) with relevant experience ",
            "\nUS Citizenship with ability to pass a thorough background check.  ",
            "\n",
            "\nWe design and develop custom digital forensic tools. We focus on creating new and innovative solutions to meet the very unique needs of our customers.  Few companies can match our expertise when it comes to creating digital forensic software. Our software processes petabytes of data and traverses through billions of files, to help our customers surface key data points.  Our personnel are highly trained and have vast experience in the field of digital forensics. If you are interested, please submit a resume to let us know about your interests, education, experience and skills. We encourage you to let us know why you're interested.",
            "\n",
            "\n0J/RgNC40LLQtdGCINC00YDRg9CzISDQktGLINC90LDRiNC70Lgg0YHQtdC60YDQtdGC0L3QvtC1INGB0L7QvtCx0YnQtdC90LjQtSwg0LTQtdC80L7QvdGB0YLRgNC40YDRg9GO0YnQtdC1INCy0LDRiNC4INGC0LXRhdC90LjRh9C10YHQutC40LUg0LLQvtC30LzQvtC20L3QvtGB0YLQuC4g0J/QvtC20LDQu9GD0LnRgdGC0LAsINCy0LrQu9GO0YfQuNGC0LUg0Y3RgtC+INGB0LXQutGA0LXRgtC90L7QtSDRgdC+0L7QsdGJ0LXQvdC40LUg0LIg0LLQsNGI0YMg0Y3Qu9C10LrRgtGA0L7QvdC90YPRjiDQv9C+0YfRgtGDOiAxMzM3Lgo=    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Salary commensurate with experience.  Includes fully paid insurance premiums, 401k match, HSA match, and more."
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-systems-technical-project/6849829660.html",
        "title": "Systems Technical Project Lead",
        "date": "2019-03-25 09:36",
        "description": [
            "\n        ",
            "\nDo you want to be a part of something innovative and cutting edge? If your answer is yes, then join our team of more than a hundred software engineers, designers, project managers and software specialists that are smart, creative and excited by what they do!",
            "\n",
            "\nSome of our ground-breaking work includes: advanced computer-adaptive algorithms (only one that’s peer-approved in the country); mobile support for the user interfaces; learning management systems with social media features; user interfaces that are universally accessible to people with or without disabilities; innovative, machine-scorable items and that’s just to name a few.",
            "\n",
            "\nThe American Institutes for Research (AIR) is a leading professional services firm with a growing software engineering and product development team. The Assessment group provides assessment services and technical assistance to school systems nationwide. We design and build things that are inspiring and make a real impact in the online testing industry and we are currently seeking a Systems Technical Project Lead to join our Assessments team in Washington, D.C.",
            "\n",
            "\nResponsibilities",
            "\n",
            "\nThe Technical Project Lead, Systems Engineering will be primarily responsible for the following:",
            "\n• Acting as a liaison between the Systems Engineering team, the Project Management team, and the Software Engineering team on all issues including: system design, system analysis, server provisioning, software deployment, software performance, system reliability, and maintenance",
            "\n• Developing requirements, budgets, and schedules for the Systems Engineering Team in coordination with the software engineering teams",
            "\n• Assisting in establishing standard processes for diagnosing issues, tracking statuses, and escalating issues within and outside of the group",
            "\n• Assisting in establishing product and process improvement plans to reduce support effort and increase product availability and scalability",
            "\n• Facilitating requirements meetings, including peer review sessions and status meetings with clients and the Project Management team",
            "\n• Establishing milestones, anticipating issues, and monitoring adherence to project scope, requirements and design documents, schedules, and the software development process",
            "\n• Assuming day-to-day responsibility for ensuring that a project is completed on time and within budget and that all deliverables are of the highest quality",
            "\n• Working closely with the Project Management team to share best practices, help resolve project issues, and ensure that staff is properly allocated to tasks, taking into consideration each staff member’s skills and interests and each project’s needs",
            "\n• Maintaining client relations and communications, including status reporting and informal conversations",
            "\n",
            "\nQualifications",
            "\n",
            "\n• Bachelor's or Master’s Degree in Information Systems, Computer Science, Engineering, Statistics, Public Administration, Business Management or a related field ",
            "\n• 7+ years of experience with a Bachelor's degree or 5+ years of experience with a Master's degree",
            "\n• Experience in applying best practices in project management, including those used to initiate, plan, control, monitor, and report upon all phases of project activity",
            "\n• Familiarity with project management tools such as Microsoft Project or BaseCamp and one or more versioning tools such as CVS, SVN, Mercurial, and Git",
            "\n• Experience with managing technical projects in a large, complex web-hosting environment",
            "\n• Knowledge of IT concepts, issues, practices, methodologies, and trends, particularly those relevant to the design of large-scale web hosting environments",
            "\n• Coordination of security related initiatives between the development teams, the system engineering team, and Rackspace",
            "\n• Knowledge of network devices and protocols used in web hosting environments, including load balancers and firewalls",
            "\n• Knowledge and familiarity with network operating systems such as Windows Server, Linux, UNIX, Mac OS Server",
            "\n• Experience with three-tier web hosting architecture: interface, application, and data",
            "\n• Ability to understand and analyze complex issues and information relating to database management",
            "\n• Excellent documentation and communication skills",
            "\n• Must be proactive, detail-oriented, and team-oriented",
            "\n• Must have an aptitude for learning new software",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive salary and benefits package"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-net-software-engineer/6849884505.html",
        "title": ".NET Software Engineer",
        "date": "2019-03-25 10:37",
        "description": [
            "\n        ",
            "\nOverview",
            "\n",
            "\nAmerican Institutes for Research (AIR) is a leading professional services firm with a growing software engineering and product development team. We design and build things that are inspiring and make a real impact in the online testing industry. Be part of something innovative and cutting edge. Join our team of more than a hundred software engineers, designers, project managers and software specialists that are smart, creative and excited by what they do. ",
            "\n",
            "\nSome of our ground-breaking work includes: ",
            "\n• advanced computer-adaptive algorithms (only one that’s peer-approved in the country) ",
            "\n• mobile support for the user interfaces ",
            "\n• learning management systems with social media features ",
            "\n• user interfaces that are universally accessible to people with or without disabilities ",
            "\n• innovative, machine-scorable items ",
            "\n",
            "\nThis Software Engineer (.NET) position can be located in our Washington, D.C. or Reston, Virginia office.",
            "\n",
            "\nResponsibilities",
            "\n",
            "\nThe Software Engineer (.NET) will be an integral part of the software engineering and product development team within AIR. This group of professionals provide custom software solutions for our clients as well as internal support systems. Much of the work we perform is new development, so the right candidate will have the skills needed to perform full life-cycle software development. This includes participation in requirements gathering, application and database design, system documentation, writing and unit-testing efficient code, and deployment.",
            "\n",
            "\nQualifications",
            "\n",
            "\n• B.S. and/or M.S. in Computer Science",
            "\n• Professional .NET software development experience ",
            "\n• 4+ years experience utilizing C#, ASP.Net, Javascript and XML ",
            "\n• SQL experience to include work with relational databases and writing SQL queries ",
            "\n• Solid understanding of object oriented (OO) analysis and design principles and demonstrated proficiency/expert knowledge in OO design ",
            "\n• Solid understanding of algorithms ",
            "\n• Self-starting, independent thinker and worker ",
            "\n• Excellent analytical skills ",
            "\n• Highly detail-oriented ",
            "\n• Good communication skills ",
            "\n• Ability to work well on a team as well as independently ",
            "\n",
            "\nPREFERRED QUALIFICATIONS: ",
            "\n• M.S. in Computer Science ",
            "\n• Training and experience in Artificial Intelligence ",
            "\n• SQL Server 2008 and Transact-SQL, C++, ASP, VB Script WP",
            "\n",
            "\n*** For initial consideration, all candidates must follow the link below and complete the coding exercise/skill set assessment***",
            "\n",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive salary and benefits package"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/junior-software-engineer/6847134401.html",
        "title": "Junior Software Engineer",
        "date": "2019-03-21 17:27",
        "description": [
            "\n        ",
            "\nZTC (",
            ") has a digital forensic software engineering positions open in Reston, VA. We are seeking an enthusiastic and motivated person with a bachelors degree in Computer Science or a related field. Relevant experience is desirable, but entry-level software engineers with academic experience and a degree are highly encouraged to apply.  The following describes the role:",
            "\n",
            "\n● Work collaboratively on a small software engineering team",
            "\n● Research and develop new content analysis capabilities",
            "\n● Write new software and maintain existing systems (using C#/.Net, C/C++, Java, Python, SQLite).",
            "\n● Provide operational and integration support for digital forensic platforms.",
            "\n● Write one-off data exploitation tools to process data not yet supported by enterprise systems",
            "\n● Integrate digital forensic, biometric, video forensic and other capabilities into an enterprise architecture",
            "\n● Work with digital forensic analysts to integrate new capabilities as required",
            "\n",
            "\nJob Requirements:",
            "\n",
            "\nEducation: Bachelors Degree in Computer Science or related discipline",
            "\nExperience: Relevant but not required",
            "\nCitizenship: U.S.",
            "\nClearance: None required to start, will obtain clearance after hiring    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Commensurate with experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-software-engineering-fellow/6845330043.html",
        "title": "Software Engineering Fellow",
        "date": "2019-03-19 14:57",
        "description": [
            "\n        ",
            "\nWhat is Pathrise",
            "\n",
            "\nPathrise (YC W18) invests in undervalued university students or young professionals by coaching them to get a competitive internship or job. The program is completely free upfront. In exchange, Pathrise fellows agree to pay back a share of their first year's salary if and only if they get hired.",
            "\n",
            "\nPathrise is based on insights from hundreds of hiring managers in tech; this means everyone from Google recruiters to startup CEOs. We've been featured in TechCrunch, VentureBeat, EdSurge, and The Atlantic as the \"Y Combinator for your career.\" To date, we've worked with over 130 fellows and have helped them land offers at Facebook, Uber, Google, Oath, Amazon, and other top companies or exciting startups.",
            "\n",
            "\nAbout the Fellowship",
            "\n",
            "\nThe Pathrise Fellowship is a program for students and new grads that helps you land the best job or internship possible in tech.",
            "\n",
            "\nDuring the fellowship, you receive 1-on-1 mentorship from experienced industry engineers, analysts, managers, and recruiters. You learn systems to attract the attention of any company you want, find out insider information on how to ace your interviews, and more. We even directly refer you to companies in our network until you find a job you love.",
            "\n",
            "\nOur Mission",
            "\n",
            "\nWe seek to uplift and provide guidance for undervalued students and young professionals in their early career. You can read more about our mission and how it all works on our website: www.pathrise.com.",
            "\n",
            "\nQualifications",
            "\n",
            "\nYou are either in university or within 5 years of graduation, and interested in getting the best possible job.",
            "\nYou want to work with an experienced advisor who can give you expert advice whether you need to learn about data structures or UI/UX patterns.",
            "\nYou are eager to start your career with a job or internship at a top tech company or a rapidly growing startup.",
            "\nYou want a team of advisors who will be by your side throughout the entire process, whenever you need, as long as you need.",
            "\n",
            "\nPlease apply here: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "80,000-160,000"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/ba-qabusiness-analyst-quality-analyst/6849885566.html",
        "title": "BA/QA(BUSINESS ANALYST/QUALITY ANALYST) TRAINING & 100% JOB PLACEMENT",
        "date": "2019-03-25 10:39",
        "description": [
            "\n        ",
            "\nBA/QA(BUSINESS ANALYST/QUALITY ANALYST) TRAINING & 100% JOB PLACEMENT",
            "\n",
            "\n",
            "\nFor more information please call 732 250 3906",
            "\n",
            "\nDemo Introduction Video: www.youtube.com/watch?v=SHj5bH6VTu8",
            "\n",
            "\n",
            "\nWe offer a Combo BA/QA Course where the students can learn the concepts of BA/QA in the same Program with out any additional effort. This also gives the flexibility for the students to choose the best Career option...BA or QA at the end of the course.",
            "\n",
            "\n100% JOB PLACEMENT ASSISTANCE RECORD. ALSO SPECIALIZE IN JOBS PLACEMENTS IN NJ,NY as we work mostly with LOCAL CLIENTS in EAST COAST.",
            "\n",
            "\nWe offer detailed ,comprehensive and Job Oriented training in Business Analyst/Quality Analysis with Placement Assistance.",
            "\nFlexible timings on Weekdays/Weekends",
            "\nProfessional guidance for resume preparation and interviews",
            "\nCounseling/One-on-one discussion with Trainer to clarify your doubts.",
            "\nFlexible timings for the training.",
            "\nAggressive marketing by experienced placement team",
            "\nH1b and Green cards sponsorship for deserving candidates",
            "\nTraining for Certifications and Reimbursement for Certifications on a need basis.",
            "\nProfessional Training and training material.",
            "\nWe are currently looking for Citizens/GC holders/OPT/CPT holders/ H1B",
            "\nWe provide excellent benefits like",
            "\n",
            "\nCompetitive Salary or hourly rates.",
            "\nHealth Insurance.",
            "\nCorporate training opportunities",
            "\nJob Placement",
            "\nResume Preparation",
            "\nDiscussion on Interview Questions",
            "\nJob Placement Support",
            "\nOn Job Support",
            "\n",
            "\n",
            "\nFor more information please call 732 250 3906",
            "\nQA Testing Course Content",
            "\nIntroduction to Software Testing",
            "\n• What is Software Testing?",
            "\n",
            "\nSoftware Development Life cycle",
            "\n• Requirements",
            "\n• Analysis",
            "\n• Design",
            "\n• Coding",
            "\n• Testing",
            "\n• Acceptance",
            "\n",
            "\nSDLC Models",
            "\n• Agile",
            "\n• Waterfall model",
            "\n• Spiral model",
            "\n• V-Model",
            "\n",
            "\nTesting-Methods",
            "\n• White Box Testing",
            "\n• Black Box testing",
            "\n• Gray Box testing",
            "\n",
            "\nTypes of Testing (Black Box Testing)",
            "\n• Build Verification Testing",
            "\n• Functional Testing",
            "\n• Integration Testing",
            "\n• Regression Testing",
            "\n• System Testing",
            "\n• Acceptance Testing",
            "\n• Smoke and Sanity Testing",
            "\n• Ad-hoc Testing",
            "\n• Exploratory Testing",
            "\n• Compatibility Testing",
            "\n• Disaster Recovery Resting",
            "\n• Load, Volume, Stress and Performance Testing",
            "\n",
            "\nTesting Life Cycle / Quality Assurance Life Cycle / Software Testing Life Cycle",
            "\n• Requirements",
            "\n• System study",
            "\n• Test plan",
            "\n• Test Cases",
            "\n• Traceability Matrix",
            "\n• Test case execution",
            "\n• Defect tracking",
            "\n• Test Summary Report",
            "\n• User Acceptance Testing",
            "\n",
            "\nTest Plan",
            "\n• Objective",
            "\n• Scope",
            "\n• Approach",
            "\n• Methodologies",
            "\n• Deliverables",
            "\n• Test environment",
            "\n• Schedule and Resources",
            "\n• Effort and estimation",
            "\n• Entry and Exit criteria",
            "\n• Templates",
            "\n• Risk",
            "\n• Assumption",
            "\n• Contingency Plan",
            "\n• References",
            "\n",
            "\nTest Case",
            "\n• Test Case Design",
            "\n• How to write test cases",
            "\n• When to execute test cases",
            "\n",
            "\nChecklists",
            "\n• How to create checklists",
            "\n• When to use checklists",
            "\n",
            "\nDefect tracking",
            "\n• Defect life cycle",
            "\n• Severity, priority",
            "\n• Defect tracking Tool -- Quality Center, Bugzilla and Rational Clear Quest",
            "\n• Defect report",
            "\n• Defect Tracking Sheet ",
            "\n• OK for recruiters to contact this job poster.",
            "\n• do NOT contact us with unsolicited services or offers",
            "\n",
            "\n",
            "\n•\tOK for recruiters to contact this job poster.",
            "\n•\tdo NOT contact us with unsolicited services or offers",
            "\n",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/arlington-sql-server-ssis-ssrs-net/6845346495.html",
        "title": "SQL SERVER SSIS SSRS & .NET TRAINING and 100% JOB PLACEMENT",
        "date": "2019-03-19 15:14",
        "description": [
            "\n        ",
            "\n",
            "\n",
            "\n",
            " \n� 100% Placement Assistance for our consultants. ",
            "\n� Free orientation/Demo class.",
            "\n� Resume Building and Technical screening by the marketing team.",
            "\n� Mock interviews for the candidates ",
            "\n� Placement Assistance with our clients in full time or consulting positions.",
            "\n� Support will be provided while you are in the project",
            "\n� H1B sponsorship and GC for qualified employees.",
            "\n� Free Training to upgrade your skills anytime for our employees.",
            "\n� Excellent marketing team for job placements. ",
            "\n\n",
            "\n",
            "\n==============",
            "==================",
            "\n",
            "\n",
            "\n",
            "\n•\tThe Basic Architecture of SQL Server",
            "\n•\tSQL Server Editions and Versions",
            "\n•\tGetting Started with SQL Server Management Studio",
            "\n",
            "\n",
            "\n•\tWriting Simple SELECT Statements",
            "\n•\tEliminating Duplicates with DISTINCT",
            "\n•\tUsing Column and Table Aliases",
            "\n•\tWriting Simple CASE Expressions",
            "\n",
            "\n",
            "\n•\tUnderstanding Joins",
            "\n•\tQuerying with Inner Joins",
            "\n•\tQuerying with Outer Joins",
            "\n•\tQuerying with Cross Joins and Self Joins",
            "\n",
            "\n",
            "\n•\tSorting Data",
            "\n•\tFiltering Data with a WHERE Clause",
            "\n•\tFiltering with the TOP and OFFSET-FETCH Options",
            "\n•\tWorking with Unknown and Missing Values",
            "\n",
            "\n",
            "\n•\tIntroducing SQL Server 2014 Data Types",
            "\n•\tWorking with Character Data",
            "\n•\tWorking with Date and Time Data",
            "\n",
            "\n",
            "\n•\tInserting Data",
            "\n•\tModifying and Deleting Data",
            "\n",
            "\n",
            "\n•\tWriting Queries with Built-In Functions",
            "\n•\tUsing Conversion Functions",
            "\n•\tUsing Logical Functions",
            "\n•\tUsing Functions to Work with NULL",
            "\n",
            "\n",
            "\n•\tUsing Aggregate Functions",
            "\n•\tUsing the GROUP BY Clause",
            "\n•\tFiltering Groups with HAVING",
            "\n",
            "\n",
            "\n•\tWriting Self-Contained Subqueries",
            "\n•\tWriting Correlated Subqueries",
            "\n•\tUsing the EXISTS Predicate with Subqueries",
            "\n",
            "\n",
            "\n•\tWriting SSIS Package Using Different Data Source",
            "\n",
            "\n",
            "\n•\tGenerate SSRS Report",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n\n==============",
            "==================",
            "\n",
            "\n",
            "\n",
            "\n•\tOverview of Writing Applications using C#",
            "\n•\tDatatypes, Operators, and Expressions",
            "\n•\tC# Programming Language Constructs",
            "\n",
            "\n",
            "\n•\tCreating and Invoking Methods",
            "\n•\tCreating Overloaded Methods and Using Optional and Output Parameters",
            "\n•\tHandling Exceptions",
            "\n•\tMonitoring Applications",
            "\n",
            "\n",
            "\n•\tImplementing Structs and Enums",
            "\n•\tOrganizing Data into Collections",
            "\n•\tHandling Events",
            "\n",
            "\n",
            "\n•\tCreating Classes",
            "\n•\tDefining and Implementing Interfaces",
            "\n•\tImplementing Type-safe Collections",
            "\n",
            "\n",
            "\n•\tCreating Class Hierarchies",
            "\n•\tExtending .NET Framework Classes",
            "\n•\tCreating Generic Types",
            "\n",
            "\n",
            "\n•\tReading and Writing Files",
            "\n•\tSerializing and Deserializing Data",
            "\n•\tPerforming I/O Using Streams",
            "\n",
            "\n",
            "\n•\tCreating and Using Entity Data Models",
            "\n•\tQuerying Data by Using LINQ",
            "\n•\tUpdating Data by Using LINQ",
            "\n",
            "\n",
            "\n•\tAccessing Data Across the Web",
            "\n•\tAccessing Data in the Cloud",
            "\n",
            "\n",
            "\n•\tImplementing Multitasking by using Tasks and Lambda Expressions",
            "\n•\tPerforming Operations Asynchronously",
            "\n•\tSynchronizing Concurrent Access to Data",
            "\n",
            "\n",
            "\n•\tCreating and Using Dynamic Objects",
            "\n•\tManaging the Lifetime of Objects and Controlling Unmanaged Resources",
            "\n",
            "\n",
            "\n•\tImplementing Symmetric Encryption",
            "\n•\tImplementing Asymmetric Encryption",
            "\n",
            "\n",
            "\n•\tIntroduction to the .NET Framework",
            "\n•\tOverview of ASP.NET",
            "\n•\tOverview of the Lab Application",
            "\n",
            "\n",
            "\n•\tChoosing a Programming Language",
            "\n•\tOverview of Visual Studio 2017",
            "\n•\tCreating a Simple Web Application",
            "\n",
            "\n",
            "\n•\tCreating Web Forms",
            "\n•\tAdding and Configuring Server Controls in a Web Form",
            "\n",
            "\n",
            "\n•\tWorking with Code-Behind Files",
            "\n•\tHandling Server Control Events",
            "\n•\tCreating Classes and Components by Using Visual Studio 2010",
            "\n•\tHandling Page Events",
            "\n",
            "\n",
            "\n•\tCreating Master Pages",
            "\n•\tAdding User Controls to an ASP.NET Web Form",
            "\n",
            "\n",
            "\n•\tOverview of User Input Validation",
            "\n•\tASP.NET Validation Controls",
            "\n•\tValidating Web Forms",
            "\n",
            "\n",
            "\n•\tDebugging in ASP.NET",
            "\n•\tTracing in ASP.NET",
            "\n",
            "\n",
            "\n•\tOverview of ADO.NET",
            "\n•\tConnecting to a Database",
            "\n•\tManaging Data",
            "\n",
            "\n",
            "\n•\tOverview of LINQ",
            "\n•\tManaging XML Data by Using LINQ to XML",
            "\n•\tManaging SQL Data by Using LINQ to SQL and LINQ to Entities",
            "\n",
            "\n",
            "\n•\tOverview of ASP.NET Dynamic Data",
            "\n•\tApplying ASP.NET Dynamic Data",
            "\n•\tCustomizing ASP.NET Dynamic Data Applications",
            "\n",
            "\n",
            "\n•\tIntroduction to Ajax",
            "\n•\tCreating an ASP.NET Ajax Application by Using the Ajax Features for ASP.NET",
            "\n•\tExtending an ASP.NET Web Forms Application by Using the Ajax Control Toolkit",
            "\n",
            "\n",
            "\n•\tOverview of Windows Communication Foundation Services",
            "\n•\tCalling Windows Communication Foundation Services",
            "\n•\tWorking with WCF Data Services",
            "\n",
            "\n",
            "\n•\tState Management",
            "\n•\tASP.NET Profiles",
            "\n•\tASP.NET Caching",
            "\n",
            "\n",
            "\n•\tConfiguring an ASP.NET Web Application",
            "\n•\tDeploying an ASP.NET Web Application",
            "\n",
            "\n",
            "\n•\tOverview of Web Application Security",
            "\n•\tDeclaratively Configuring Authentication and Authorization",
            "\n•\tWorking Programmatically with Authentication and Authorization",
            "\n",
            "\n",
            "\n•\tOverview of Microsoft Web Technologies",
            "\n•\tOverview of ASP.NET 4.5",
            "\n•\tIntroduction to ASP.NET MVC 6",
            "\n",
            "\n",
            "\n•\tPlanning in the Project Design Phase",
            "\n•\tDesigning Models, Controllers, and Views",
            "\n",
            "\n",
            "\n•\tCreating MVC Models",
            "\n•\tWorking with Data",
            "\n",
            "\n",
            "\n•\tWriting Controllers and Actions",
            "\n•\tWriting Action Filters",
            "\n",
            "\n",
            "\n•\tCreating Views with Razor Syntax",
            "\n•\tUsing HTML Helpers",
            "\n•\tReusing Code in Views",
            "\n",
            "\n",
            "\n•\tUnit Testing MVC Components",
            "\n•\tImplementing an Exception Handling Strategy",
            "\n",
            "\n",
            "\n•\tAnalyzing Information Architecture",
            "\n•\tConfiguring Routes",
            "\n•\tCreating a Navigation Structure",
            "\n",
            "\n",
            "\n•\tUsing Template Views",
            "\n•\tApplying CSS to an MVC Application",
            "\n•\tCreating an Adaptive User Interface",
            "\n",
            "\n",
            "\n•\tUsing AJAX and Partial Page Updates",
            "\n•\tImplementing a Caching Strategy",
            "\n",
            "\n",
            "\n•\tRendering and Executing JavaScript Code",
            "\n•\tUsing jQuery and JQueryUI",
            "\n",
            "\n",
            "\n•\tImplementing Authentication and Authorization",
            "\n•\tAssigning Roles and Membership",
            "\n",
            "\n",
            "\n•\tDeveloping Secure Sites",
            "\n•\tState Management",
            "\n",
            "\n",
            "\n•\tIntroducing web service",
            "\n•\tDesigning and Writing Windows web Services",
            "\n•\tConsuming Windows web Services in a Web Application",
            "\n",
            "\n",
            "\n•\tDeveloping a Web API",
            "\n•\tCalling a Web API from Mobile and Web Applications",
            "\n",
            "\n",
            "\n•\tUsing HTTP Modules and HTTP Handlers",
            "\n•\tUsing Web Sockets",
            "\n",
            "\n",
            "\n•\tDeploying a Web Application",
            "\n•\tDeploying an MVC 5 Application",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-performance-tester/6849997460.html",
        "title": "Performance Tester",
        "date": "2019-03-25 12:21",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking a talented Performance Tester that has worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\nRequirements: ",
            "\n- Must have experience with Performance testing tools LoadRunner/Performance Center and Dynatrace",
            "\n- Has done some aspect of performance testing with a Java based application ",
            "\n- Experience in Performance test planning, Script development, Script execution, monitoring and Report analysis",
            "\n  has done some aspect of performance testing with a Java based application",
            "\n- Must be willing to commute to DC 4-5 days a week",
            "\n- Curam skills are good to have ",
            "\n- Outstanding communication skills",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/silver-spring-database-administrator-dba/6846165131.html",
        "title": "Database Administrator (DBA)",
        "date": "2019-03-20 14:50",
        "description": [
            "\n        ",
            "\nLooking for a collaborative, fun company with room for growth?",
            "\n",
            "\nIMS, Inc. is a recognized leader in the biomedical IT field, with clients including the NCI, CDC, & major pharmaceutical firms. We are a diverse group of people with a focus on product quality, customer satisfaction, & enjoying what we do. We have a relaxed, friendly work environment, where employees are recognized for the work that they do. Add to that work/life balance, social events, casual dress, & no cubicles- that’s why many employees have stayed with us.",
            "\n",
            "\nJoin us as a Database Administrator & see what makes IMS such a unique place to work!",
            "\n",
            "\nAs an entry-level DBA, you will:",
            "\n•Design, develop, administer, & maintain the integrity, security, & availability of multiple relational databases for our biomedical information systems",
            "\n•Perform disaster recovery, index maintenance, & database user account maintenance",
            "\n•Assist with performance analysis and tuning & data organization and storage",
            "\n•Perform other database administration related duties as assigned",
            "\n",
            "\nTo be eligible for this position, you must meet the following requirements:",
            "\n•BA/BS in CompSci, IS, Math, or related field from a U.S. DOE accredited institution with a 2.9+ GPA",
            "\n•0-4 years of related experience",
            "\n•Proficiency with SQL",
            "\n•Knowledge of relational database analysis & design (Postgres, Oracle, MySQL, Sybase, or MS-SQL)",
            "\n•Familiarity with scripting languages (Python, Perl, Shell Scripting, etc.)",
            "\n•Experience with revision control systems (Git, Subversion, Mercurial, CVS, etc.)",
            "\n•Experience in Linux systems and deployment automation a plus",
            "\n•Demonstrated strong verbal & written communication skills",
            "\n•Demonstrated ability to relay technical information to clients & users in layman terms",
            "\n•Demonstrated strong problem-solving & analytical skills",
            "\n•Demonstrated customer service skills",
            "\n•Excellent attention to detail & organization skills",
            "\n•Must be able to multi-task, meet deadlines, & work within a team",
            "\n•Ability to obtain & maintain a security clearance",
            "\n•Strong presentation skills preferred",
            "\n",
            "\nIf this sounds like the right position for your career, apply today at: ",
            ". ",
            "\n",
            "\nIMS is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristic protected by applicable law.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "competitive, commensurate with experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/reston-embedded-software-engineer/6845787155.html",
        "title": "Embedded Software Engineer",
        "date": "2019-03-20 07:38",
        "description": [
            "\n        ",
            "\n",
            "\n",
            "\n",
            "\n",
            "\nAmerican Well, a leading telehealth platform in the US, is seeking a highly motivated and professional individual with expertise in device engineering. At American Well, we believe digital care delivery will transform healthcare. Our mission is to connect and enable providers, insurers, patients, and innovators to deliver greater access to more affordable, higher quality care. We do this by partnering with our clients to deliver video visits over mobile and web. We have doctors, therapists, and specialists on staff to help people get care when and where they need it most.",
            "\n",
            "\nBrief Overview:",
            "\n",
            "\nThe Embedded Software Engineer will play a critical role in the Devices department. Can you take a product vision and translate it into a working solution? Our team is searching for a person with experience designing and developing embedded software who can help solve some of our most challenging telehealth device engineering problems. The Embedded Software Engineer (ESE) will play a key role in designing and bringing revolutionary products to market. Working closely with cross-functional teams, the ESE will use cutting edge tools and approaches to deliver awesome products, that create amazing user experiences in surprisingly short timelines.  You’ll be key part of our engineering team and helping us revolutionize the access people have to healthcare services. Specifically, the Embedded Software Engineer will:",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n • Develop new software to bring the Internet of Things (IoT) to healthcare",
            "\n • Create and test embedded software on-top of an Operating System (Linux or RTOS)",
            "\n • Develop device drivers for communication with custom electronics and medical devices",
            "\n • Customize Linux distributions for deployment into healthcare environments",
            "\n • Create and maintain processes for development and testing of embedded software for safety-critical, fault-tolerant operation",
            "\n • Collaborate with internal teams (Device Engineering, Software Engineering, and Product Management) to deliver products on-time and to specification",
            "\n • Design and develop robust communication protocols",
            "\n • Work with 3rd party vendors to support their hardware on the American Well platform",
            "\n • Evaluate processes, tools and approaches to potentially incorporate into how we develop products to ensure we are always learning and improving",
            "\n • Perform other duties as assigned",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n • Bachelor’s degree in Computer Engineering or Computer Science",
            "\n • 2 – 4 years experience in C/C++ coding (preferably on a Linux-based OS)",
            "\n • Familiarity with embedded Linux, RTOS operating systems, web connectivity and IoT",
            "\n • Experience with the following devices is a plus: medical devices; mobile carts, power supplies, cable assemblies, computer and video equipment",
            "\n • Driven to own the process and deliver the solution",
            "\n • Excellent problem-solving, organizational and analytical skills, with the ability to evolve strategy based on research, data and industry trends",
            "\n • Strong communication and organizational skills",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\nYour Team:",
            "\n",
            "\nShould you join American Well and the Hardware team, you can expect:",
            "\n",
            "\nAmerican Well’s Device Engineering group is a mission-focused technology team made up the best and brightest technical talent. Operating out of our office in Reston, VA, our engineers specialize in electrical, mechanical, firmware, software, and embedded systems design and development. We design, develop, and test cutting-edge telehealth products in a fast-paced interdisciplinary team.",
            "\n",
            "\nOur mission is to transform healthcare and to be the premier distributor of provider services by creating and operationalizing devices that enable consumption of telemedicine, deliver an awesome user experience and capture exceptional business value",
            "\n",
            "\nIf you enjoy working hard, challenging yourself, and staying at the cutting edge of technology, this is the team for you.  ",
            "\n",
            "\nWorking at American Well",
            "\n",
            "\nAmerican Well is changing how care is delivered through online and mobile technology. We strive to make the hard work of healthcare look easy. In order to make this a reality, we look for people with a fast-paced, mission-driven mentality. We’re a go-getter culture that prides itself on quality, efficiency, smarts, initiative, creative thinking, and a strong work ethic. In addition to the opportunity to build the future of healthcare technology and a great location, we offer:",
            "\n",
            "\n • Unlimited Personal Time Off (Vacation time)",
            "\n • 401K match",
            "\n • Competitive healthcare, dental and vision insurance plans",
            "\n • Complimentary snacks and drinks",
            "\n",
            "\n",
            "\nPlease APPLY ONLINE at: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "competitive"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/arlington-executive-assistant-brand/6850120515.html",
        "title": "EXECUTIVE ASSISTANT/BRAND MANAGER FOR #1 REAL ESTATE TEAM NEEDED!",
        "date": "2019-03-25 14:11",
        "description": [
            "\n        ",
            "\nThe Keri Shull Team/Orange Line Living Team has been one of the top sales teams in Arlington, VA for the last 7+ years. Due to the growth in our Real Estate Team and Agent Training Business, we are looking for an Executive Assistant/Brand Manager to work directly for the founder of the team. The founder of the team became the top salesperson in the Rosslyn-Ballston corridor immediately after beginning his real estate career in 2011 and has been number one in sales ever since with over 100% growth since 2012. This is a huge opportunity for growth, development and upward mobility.",
            "\n",
            "\n*EXPERIENCE IN DIGITAL MEDIA IS A HUGE PLUS",
            "\n*EXPERIENCE IN WORDPRESS IS A HUGE PLUS",
            "\n*EXPERIENCE IN MANAGING ECOMMERCE IS A HUGE PLUS",
            "\n",
            "\nTasks include, but are not limited to:",
            "\n-Ensure that all systems and processes run efficiently, making revisions as needed",
            "\n-Coordinating with other key team members to accomplish marketing, customer relationship management and administrative tasks",
            "\n-Develop, implement and revise marketing campaigns including: direct mail, email, web marketing, social media, and blogging",
            "\n-Manage email/calendars/travel ",
            "\n-Focus on brand growth of our agent training business including, but not limited to:",
            "\nManaging agent relationships and communication",
            "\nManaging all social platforms",
            "\nGetting all training courses loaded",
            "\nInterviewing applicants",
            "\nManaging all emails and follow up",
            "\nPlanning for all events",
            "\n",
            "\nQUALIFICATIONS: ",
            "\n",
            "\n-You are self-motivated and feel empowered in a dynamic, fast-paced environment",
            "\n-You are committed to a culture of positivity and high performance",
            "\n-You value feedback, and thrive on constant improvement and learning",
            "\n-You have a strong work ethic and a self-driven desire to succeed",
            "\n-You are excited by the opportunity to win as an individual contributor",
            "\n-You have extremely strong written and verbal communication skills",
            "\n-You are relentless",
            "\n-You are focused",
            "\n-You are growth minded",
            "\n-You are detail oriented",
            "\n-You are organized",
            "\n",
            "\nAMAZING BENEFITS:",
            "\n",
            "\n-Paid time off ",
            "\n-Health insurance ",
            "\n-Financial planning ",
            "\n-Education reimbursement ",
            "\n-Free groceries ",
            "\n-Free rooftop gym ",
            "\n-Modern and comfortable office in Rosslyn ",
            "\n",
            "\n",
            "\nHOW TO APPLY: ",
            "\n",
            "\nTo apply for this position, please send your resume to recruiting@kerishullteam and tell us why you would be an ideal candidate for our team. Please also include your favorite color in the subject line. Failure to do either of these will disqualify you from the position.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "TBD BASED ON EXPERIENCE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/silver-spring-business-analyst-tester/6847588316.html",
        "title": "Business Analyst / Tester",
        "date": "2019-03-22 11:19",
        "description": [
            "\n        ",
            "\nBusiness Analyst / Tester – Silver Spring, MD",
            "\n",
            "\nPosition Description",
            "\nWill determine operational objectives and study NOAA mission goals; evaluate current business processes and recommend improvements; and translate improved processes into business and technical requirements. Will analyze business and technical requirements, map data flow, and write system specifications; develop wireframes and user stories that are intuitive and efficient; and construct workflow charts, data flow diagrams, and data management plans. Will be responsible for the development of test scenarios, test cases and test plans, execution of test cases and any overall continuous process improvement to the testing process and methodologies. Will also:",
            "\n",
            "\n•\tInteract with client and development teams on a regular basis to obtain requirement and design details.",
            "\n•\tDeliver software development lifecycle artifacts; collaborate with business owners on all aspects of needs analysis and system inventory; support tracking and prioritization of new requirements, enhancements, and defect resolution; and conduct market research and gather pricing information. ",
            "\n•\tDefine and identify project milestones, phases, and dependencies; provide support in determining project resource/budget requirements; and monitor project progress by tracking activity, resolving problems, publishing progress reports, and recommending process changes.",
            "\n•\tMaintain system protocols by writing and updating procedures; support system reporting; support release management process; develop and maintain test documentation and support project team in following and implementing software development lifecycle best practices. ",
            "\n•\tProvide references for users, maintain user documentation, provide help desk support, conduct user acceptance testing, and deliver training to users; maintain user confidence and protect operations by keeping information confidential; and serve as the liaison between content contributors, the designer/technician, and the server administrator to manage the timely, accurate update of all web content. ",
            "\n•\tEvaluate, recommend, and support testing efforts and general test strategies.",
            "\n•\tDevelop, publish and implement test plans.",
            "\n•\tDevelop thorough and organized documentation for test cases by clearly articulating test objectives, steps, and expected results",
            "\n•\tDesign and execute workflow, test case plans, implementation points, and test data before development is complete",
            "\n•\tProduce meeting minutes and provide other administrative support, as needed.",
            "\n",
            "\nRequired Skills",
            "\n6+ years of experience capturing requirements and testing web applications. Must have the ability to analyze and translate requirements and development use cases into test scripts; hands-on experience with the latest QA technologies; experience in creating test requirements, test plans, test scenarios and test scripts for automated testing; and experience executing test scripts. Must have excellent oral and written communication skills for technical and non-technical audiences, organizational skills; and strong teamwork and partnering skills for cross-group collaboration. ",
            "\n",
            "\nMust be a US Citizen or a Permanent Resident and be able to pass a background investigation to obtain a security badge to enter the applicable government facility.",
            "\n",
            "\nEducation",
            "\nBS in Computer Science, related discipline, or equivalent.",
            "\n",
            "\nSubmit resume to ERT's Career Opportunities Web Page at: ",
            "\n",
            "\nEarth Resources Technology, Inc. (ERT)",
            "\nERT is a VEVRAA Federal Contractor and Equal Opportunity/Affirmative Action employer - All qualified applicants will be considered for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status.",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/chantilly-java-or-java-microservices/6847744731.html",
        "title": "Java or JavaScript Microservices Developer",
        "date": "2019-03-22 13:39",
        "description": [
            "\n        ",
            "\nOur client is a leading provider of identity risk management, privacy protection and other subscription-based services for consumers. Their core services monitor personal information for consumers, aggregate it into digestible, consumer-friendly reports and alerts, and provide personalized education and support to help customers understand their information and take the actions they deem appropriate. Since its business was founded in 1996, they have helped protect the identities of more than 47 million consumers.",
            "\n",
            "\nThis isn’t the typical software development position in the typical run-of-the-mill tech company. We are looking for seasoned professionals to join in continuing their cloud-native buildout of a serverless, microservice-based architecture in AWS. Are you ready to have a huge impact on an industry leading product company? Are you ready to not only work with the latest technologies but to push boundaries and innovate?",
            "\n",
            "\nSpecifically, you will help:",
            "\n",
            "\n·\tBuild Java or JavaScript-based, serverless microservices using AWS Lambda.",
            "\n·\tLeverage other managed services like AWS API Gateway, Cognito and DynamoDB.",
            "\n·\tPlug into an event-based architecture built on SNS and SQS.",
            "\n·\tCollaborate, deliver and operate with developer-preferred tools like Slack, Git, Jenkins, Terraform and PagerDuty.",
            "\n·\tOwn what you build. In other words, you don’t just deliver code, you deliver the entire solution including automated tests, infrastructure, monitoring and alerting.",
            "\n·\tInnovate and lead in the areas of personal privacy and data protection.",
            "\n",
            "\nYou are an experienced Java or JavaScript developer and don't mind using multiple languages. You are passionate about what you do and take great pride in your work. You think outside the box and challenge existing conventions while keeping it real and positively influencing others. You have experience in an agile development environment where agile, lean and DevOps principles are a way of life. You have experience using AWS managed services and delivering the related infrastructure via CloudFormation or Terraform.",
            "\n",
            "\nYou get big bonus points for the following qualities:",
            "\n",
            "\n·\tWorking knowledge of architectural paradigms like REST, serverless, event-driven systems and microservices",
            "\n·\tDeep knowledge of the latest in Lambda (e.g., layers, sizing, accessing VPC resources, etc.)",
            "\n·\tExperience with domain-driven design and event sourcing",
            "\n·\tExperience building automated delivery pipelines for CI/CD and test automation",
            "\n·\tExperience with data lakes, data analytics, ML/AI and business intelligence/reporting",
            "\n",
            "\nThis is a long term contact, and potentially contract-to-hire opportunity.  The initial rate would be between $80-$100/hr as a 1099.  If you would prefer to be a full employee of AAJ interactive during the contracting period, we can talk through comparable compensation on salary.",
            "\n",
            "\nThe location for this work will be on-site at our clients offices in Chantilly VA.  Please do not apply if you don’t want to be on-site a majority of your time (there will be limited remote work possible, but this is an on-site position).",
            "\n",
            "\nIf this sounds like you, please respond with your compensation/salary requirements as soon as possible.",
            "\n",
            "\nPlease no telecommuters or agencies.",
            "\n",
            "\n===================================================",
            "\n",
            "\nAbout AAJ Interactive Technologies:",
            "\n",
            "\nAAJ Interactive Technologies, established in 1997 by cutting-edge technology executives, is a technology professional-services company supplying project-based consulting, staff augmentation, and recruiting services to leading firms throughout Metropolitan Washington, DC area.",
            "\n",
            "\nWe work differently from most of our competition.  In our careers, we have been the ones doing the hiring (managing and mentoring large staffs in a corporate culture), and we have been the ones being hired (consulting in small and large roles alike).  This unique perspective allows us to understand both sides of this business.  We take the time to ensure our consultants/candidates will be successful where they are placed.",
            "\n",
            "\nWe believe that because of our principles we have succeeded where others have failed.  The recruiting/technology space can be full of companies that are not really looking out for your interests – ask around … we’re not one of them!  We want you to succeed, and we’ll do everything we can to help you do just that!",
            "\n",
            "\n",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "$80-$100/hr (1099 or C2C)"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/leesburg-business-applications/6850308899.html",
        "title": "Business Applications Administrator",
        "date": "2019-03-25 17:23",
        "description": [
            "\n        ",
            "\nWant to make a difference? Join an organization that has been transforming lives for over 40 years! ",
            "\n",
            "\n ",
            "\n",
            "\nPrison Fellowship® trains and inspires churches and communities—inside and outside of prison—to support the restoration of those affected by incarceration. We equip correctional leaders, volunteers, and incarcerated men and women to make prisons more rehabilitative places; we advocate for a more restorative criminal justice system; and we collaborate with churches and local service providers to support former prisoners, their families, and their communities. ",
            "\n",
            "\n ",
            "\n",
            "\nWhat we are looking for: ",
            "\n",
            "\n ",
            "\n",
            "\nA driven and team focused Business Applications Administrator to support Prison Fellowship’s CRM (Salesforce) and Marketing Automation (Marketo) systems.  The successful candidate will have a solid understanding of basic principles of the Christian faith, a Bachelor’s Degree in Computer Science or related field, and 2+ years of relevant experience, including: ",
            "\n",
            "\n ",
            "\n",
            "\nMust have CRM experience. ",
            "\n",
            "\nExperience integrating systems such as CRM and email. ",
            "\n",
            "\nStrong understanding of database management systems and practical experience in SQL, querying large and complex datasets. ",
            "\n",
            "\n ",
            "\n",
            "\nWhat we offer:  ",
            "\n",
            "\n ",
            "\n",
            "\nA team oriented, mission driven, supportive environment with cutting edge technology solutions and tremendous opportunity for growth and development.  Our outstanding benefits package, includes paid leave starting at 39 days (14 holidays, 15 vacation days, 10 sick days), retirement account funding and much more!  ",
            "\n",
            "\n ",
            "\n",
            "\nVisit us at ",
            " to apply and to learn more about Prison Fellowship. ",
            "\n",
            "\n ",
            "\n",
            "\nCheck out our YouTube channel to see how Prison Fellowship is transforming lives!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Salary position"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/leesburg-developer-program-analyst/6850313740.html",
        "title": "Developer/Program Analyst",
        "date": "2019-03-25 17:29",
        "description": [
            "\n        ",
            "\nWant to make a difference? Join an organization that has been transforming lives for over 40 years! ",
            "\n",
            "\n ",
            "\n",
            "\nPrison Fellowship® trains and inspires churches and communities—inside and outside of prison—to support the restoration of those affected by incarceration. We equip correctional leaders, volunteers, and incarcerated men and women to make prisons more rehabilitative places; we advocate for a more restorative criminal justice system; and we collaborate with churches and local service providers to support former prisoners, their families, and their communities. ",
            "\n",
            "\n ",
            "\n",
            "\nWe are looking for a driven and team focused Developer/Program Analyst to join our amazing team! This role is needed to apply understanding of internal business needs in the analysis, design, and development of computer-based applications.   ",
            "\n",
            "\n  ",
            "\n",
            "\nThe successful candidate will possess the following qualifications: ",
            "\n",
            "\n ",
            "\n",
            "\nSolid understanding of basic principles of Christian faith ",
            "\n",
            "\n2+ years of relevant and related experience  ",
            "\n",
            "\nBachelor’s Degree in Computer Science or related major or equivalent experiences ",
            "\n",
            "\nStrong knowledge of SQL and understanding of relational databases.  Familiarity and experience with major enterprise database programs. ",
            "\n",
            "\nExperience in internet technologies, excellent programming abilities in common languages and frameworks, such as PHP, HTML, CSS, C#/C++, Java Enterprise/AJAX and Microsoft .NET.  Salesforce Apex and Visualforce experience is a plus. ",
            "\n",
            "\nStrong interpersonal and communication skills to collaborate effectively with business analysts, developers and other stakeholders. ",
            "\n",
            "\nDemonstrate calm under pressure, is a proactive contributor with an eagerness to learn. ",
            "\n",
            "\nAdditional skills ",
            "\n",
            "\nBe able to work creatively and analytically in a problem-solving environment to develop, enhance and maintain CRM solutions.   ",
            "\n",
            "\nUnderstand and conceptualize applications from both a technical/programming perspective and business point of view.   ",
            "\n",
            "\nMust be capable to juggling multiple projects involving various end users, meet deadlines and proactively communicate status updates.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Salary position"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/ashburn-multiple-us-locations-aws-cloud/6834448037.html",
        "title": "Multiple US locations - AWS Cloud, Big Data Hadoop and more...",
        "date": "2019-03-05 19:12",
        "description": [
            "\n        ",
            "\nOur clients in multiple US locations have multiple positions opened for AWS Cloud Engineer, SysOps Admin, DevOps, Architect, Developer and Big Data Hadoop Administrator, Developer, Data Analyst, Data Scientist. ",
            "\n",
            "\nHere is AN EXCELLENT OPPORTUNITY in your way for a ROCK SOLID professional career and to achieve your dream job!! ",
            "\n",
            "\nIf you are currently located in VA/DC/MD area, strongly motivated to get started working with the hottest and revolutionary technologies and ready to embark on a very bright IT career path, please call us today to discuss the opportunities in your way or send us your updated resume asap, even if you have little or no IT experience with Cloud or BigData technologies. We are sponsoring necessary offsite/onsite training to the eligible candidates for the immediate job placement with our clients to fill in Big Data Hadoop and AWS Cloud job positions in IT.",
            "\n ",
            "\n",
            "\nJob Requirements: ",
            "\n=============",
            "\n",
            "\nUS Citizenship or Green Card is required",
            "\nWillingness to travel or relocate",
            "\nBS/MS Degree in Computer Science, Engineering or related field is preferred",
            "\nCandidates local to VA/DC/MD are preferred.",
            "\n ",
            "\n============================================================================",
            "\nCall us today @ 703-598-4434 ",
            "\n",
            "\nAt INFOSOFTWORLD INC., your success is our passion! Let's get started for a creative, long lasting and highly fruitful professional RELATION now!! ",
            "\n",
            "\nVisit us at www.infosoftworld.com",
            "\n============================================================================    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "$$$$$"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/rockville-kronos-configuration-expert/6828641010.html",
        "title": "Kronos Configuration Expert",
        "date": "2019-02-26 12:10",
        "description": [
            "\n        ",
            "\nLocal government agency in Rockville MD is seeking a Kronos Configuration Expert.  The position is for 6 months with extension possibilities. The ideal candidate will have experience with in Kronos Workforce Timekeeper 6.2+, MCtime, and potentially worked with the agencypreviously..  H1s will be considered by must have perfect communications skills.  All candidates must be available for a face-to-face interview.   ",
            "\n",
            "\nScope of Work:",
            "\n",
            "\n 1)  Contractor will provide technical staff to provide on-going operational support throughout the pay cycle, provide configuration expertise as well as performing system configuration, documentation related to requirements gathering, standard operating procedures, lessons learned and training.  The ideal candidate will have expertise in project management for several projects of varying scopes for various departments for the Department of Finance MCtime (timekeeping) team.",
            "\n",
            "\n ",
            "\n",
            "\n2)  Contractor will provide candidate(s) with Expert experience in:",
            "\n",
            "\n-Workforce Timekeeper Web-Based and Timeclock implementations/upgrades",
            "\n-Implementations with integration from and to multiple applications",
            "\n-Leading implementations of department specific timekeeping related processes and procedures used in conjunction with timekeeping and scheduling applications",
            "\n-Communicating with all levels of staff and management, verbally and written maintaining a positive customer-oriented focus",
            "\n-Providing leadership, project planning and organization, to multiple diverse projects of varying size and scope including meeting facilitation and note taking/distribution",
            "\n-Complex Workforce Timekeeper configurations - Proficiency in configuring pay rules, work rules and assignment rules; accrual codes and profiles",
            "\n-Experience in gathering requirements and documenting new and existing processes and/or related issues ",
            "\n-Quickly learning and understanding the Agency’s configuration ",
            "\n-Knowledgeable in reviewing/creating/modifying reports using Workforce Integration Manager or other Kronos --Reporting Tools and SQL queries",
            "\n-System testing related to new implementations, upgrade, regression and other system integrations.",
            "\n-Troubleshooting issues with existing configuration and/or imports and recommending solutions to resolve",
            "\n-Participating in developing training materials and facilitating training sessions as necessary",
            "\n-Experience using Microsoft Excel, Word, and automated email system, such as Office 365. ",
            "\n-Overall the position requires that the candidate possess an elevated level of attention to detail, strong oral and written communication skills, and a strong sense of ownership and accountability for work performed.  Work well in a change environment while maintaining a strong positive perspective. ",
            "\n ",
            "\n",
            "\nRequired Skills:",
            "\n",
            "\nDemonstrated proficiency in Kronos Workforce Timekeeper 6.2+;",
            "\n-Proficiency in configuring pay rules, work rules, combination rules, assignment rules",
            "\naccrual codes and profiles; Knowledgeable in creating/modifying Workforce Integration Manager and SQL queries to create/modify reports",
            "\n-Experience in various system testing; Implementation experience with integration to/from multiple applications",
            "\n-Project planning and organization for multiple diverse projects",
            "\n-Skilled communicator with all levels of staff and management both written and verbal",
            "\n-Ability to create written documentation for new and existing processes and/or related",
            "\n ",
            "\n",
            "\nPreferred Skills:",
            "\n",
            "\n-Experience upgrading from Workforce Timekeeper 6.0 to 8.X.",
            "\n-Have experience with automated scheduling modules such as TeleStaff, Advanced Scheduler or Trapeze.",
            "\n ",
            "\n",
            "\nBackground:",
            "\n",
            "\nThe agency utilizes Kronos Workforce Timekeeper Version 6.2, internally called MCtime, to collect time and attendance data for the agency workforce.  The Agency has 40 departments with approximately 13000 records in the Kronos on-premise database.  The Agency uses both the HTML and JAVA platforms and both the project and hourly timecard view.  Most employees enter time via the internet, however, approximately 400 employees began using Kronos InTouch timeclocks, February 2019.  Various scheduling systems interface with Kronos Workforce Timekeeper Version 6.2 to support the operational needs of individual departments.   The Department of Transportation, Transit Division, uses Trapeze; The Department of Transportation, Highway Services Division, uses in internal application called Crew Day Card.  The Department of Correction and Rehabilitation. Fire and Rescue Services and the Police Department all use TeleStaff.  Timekeeping policies and processes are governed by the Agency Personnel Regulations and Collective Bargaining Agreements. ",
            "\n",
            "\n ",
            "\n",
            "\nGeneral system administration is required throughout the fourteen day pay cycle.  Tasks include, but are not limited to, processing of special employee group access and schedule change forms, creating/maintaining/assigning schedule patterns and groups, reviewing and taking appropriate action on Transaction Assistant errors, monitoring routine interface jobs, creating reports based on changing business needs, modifying look up tables, creating/modifying SQL queries to support timekeeping related processes and configuration/re-configuration of pay codes, pay rules, work rules and/or assignment rules. ",
            "\n",
            "\n ",
            "\n",
            "\nWhile maintaining current operations, the Agency is also preparing to upgrade to Kronos Workforce Timekeeper Version 8.X.  Several upgrade tasks are required for a smooth transition.  These tasks include, but are not limited to, new feature configuration, conversion of existing workforce integration manager interfaces, revision of SQL queries, updates to genies, hyperfinds, extensive testing between scheduling systems and MCtime, etc.  Participation in the creation of training documents will also be required.  Facilitation of department briefings and/or training may be required. ",
            "\n",
            "\n ",
            "\n",
            "\nFuture potential projects include integrating additional scheduling systems and/or bringing additional departments onto Kronos InTouch timeclocks.  The Agency may also evaluate Kronos Workforce Dimensions.     ",
            "\n",
            "\n ",
            "\n",
            "\n     "
        ],
        "employment_type": "contract",
        "compensation_type": "$50-65/hr"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/annapolis-junction-collision-repair/6830784701.html",
        "title": "Collision Repair Technician",
        "date": "2019-03-01 06:25",
        "description": [
            "\n        ",
            "\n\n\n\n\n",
            "\n",
            "\nPenske Truck Collision Repair centers specialize in commercial vehicle\nrecovery, repairs and refinishing-from minor scrapes and scratches to\nmajor body and chassis repairs. Our highly skilled technicians use the\nlatest technology, repairtechniques and diagnostic equipment to get our\ncustomers’ trucks back up and running in the same great condition. A\nPenske Collision Repair/Body Shop Technician III will perform minor\ntruck and trailer component repair or replacement. Assist in the\nremoval, replacement, and repair of major components.",
            "\n",
            "\n",
            "\n- competitive hourly pay",
            "\n- performance incentive bonus",
            "\n- no weekend hours",
            "\n- stable 40hr/week schedule",
            "\n- health benefits",
            "\n- retirement plan",
            "\n- provided uniforms",
            "\n- advancement opportunities",
            "\n",
            "\n",
            "\n",
            "\n- Perform the following repairs or replacements: Minor electrical\nsystem repairs, Surface preparation for refinishes, Minor Cab Accessory\nrepair/ replacement, Minor Cargo Box repairs",
            "\n- Maintain work area appearance and safety",
            "\n- Other projects and tasks as assigned by supervisor",
            "\n",
            "\n",
            "\n-  At least 2 years of related experience (or an equivalent\ncombination of related education and experience) preferred",
            "\n- High School Diploma or equivalent required",
            "\n- Vocational/technical school preferred",
            "\n- Certification of completion of technical school specializing in the\nrepair/refinish of all series of truck and trailer preferred",
            "\n- Working knowledge of tools of trade (including welding equipment,\npaint equipment, shop machines, and power tools) required",
            "\n- Regular, predictable, full attendance is an essential function of the\njob",
            "\n- Willingness to travel as necessary, work the required schedule, work\nat the specific location required, complete Penske employment\napplication, submit to a background investigation (to include past\nemployment, education, and criminal history) and drug screening are\nrequired.",
            "\n",
            "\n",
            "\n- The physical and mental demands described here are representative of\nthose that must be met by an associate to successfully perform the\nessential functions of this job. Reasonable accommodations may be made\nto enable individuals with disabilities to perform the essential\nfunctions.",
            "\n- The associate will be required to remember and understand certain\ninstructions, guidelines or other information. The associate must be\nable to see and verbally communicate. Specific vision abilities\nrequired by this job include\nclose vision, distance vision, peripheral vision, depth perception and\nthe ability to adjust focus.",
            "\n- While performing the duties of this job, the associate will be\nrequired to move frequently, stand, walk, and sit. The associate is\nfrequently required to use hands to touch, handle, and feel, and to\nreach with hands and arms. The associate must be able to regularly lift\nand/or move up to 50lbs/23kg and occasionally lift and/or move up to\n100lbs/45kg.",
            "\n ",
            "\n",
            "\nPenske Truck Leasing Co., L.P., headquartered in Reading, Pennsylvania,\nis a partnership of Penske Corporation, Penske Automotive Group, and\nMitsui & Co., Ltd. A leading global transportation services\nprovider, Penske operates more than 260,000 vehicles, employs more than\n29,000 people, and serves customers from more than 1,000 locations in\nNorth America, South America, Europe, Australia, and Asia. Product\nlines include full-service truck leasing, contract maintenance,\ncommercial and consumer truck rentals, used truck sales, transportation\nand warehousing management and supply chain management solutions. Visit\n",
            " to learn more.",
            "\n ",
            "\n",
            "\nAutomotive, Diesel, Diesel Repair, Diesel Tech, Diesel Mechanic, Gas\nMechanic, Mechanic, Hydraulics Auto Repair, Truck Repair, Trailer\nRepair, Equipment Installer, Electronic Diagnostic, Car Carrier Repair,\nMechanical Repair, Installer, Truck Equipment, Auto Mechanic, ASE\nCertified, ASE, Automotive, Repair, Light And Heavy Duty Trucks, Truck\nMechanic Service Technician, Heavy Truck & Equipment Technician,\nHeavy Truck Mechanic, Equipment Mechanic, Shop Mechanic, Truck\nMechanic, Fleet Mechanic, Fleet Technician, Trailer Mechanic, Universal\nTechnical Institute, UTI, Wyotech, Lincoln College of Technology,\nLincoln Tech, Detroit Diesel, Cummins, Eaton, Meritor, Mack,\nInternational, Peterbilt, Kenworth, Volvo, Freightliner, Hino, Isuzu",
            "\n \n",
            "\nTo apply for this position, please ",
            "\n\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "20+ hourly"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/college-park-software-engineer/6828691060.html",
        "title": "Software Engineer",
        "date": "2019-02-26 12:56",
        "description": [
            "\n        ",
            "\nSoftware Engineer – College Park, MD",
            "\n",
            "\nPosition Description",
            "\nWill perform the technical maintenance of HYSPLIT applications in support of NOAA’s Air Resources Laboratory (ARL). Will review existing capabilities of the HYSPLIT transport and dispersion modeling system on the PC, Mac, and LINUX/UNIX platforms to become familiar with the installation of the model and its components on various platforms. Will develop open-source Python graphical programs and scripts to replace current PostScript generated graphics with professional outputs on detailed map backgrounds ensuring existing capabilities are retained in any new programs; enable direct graphical output or conversion to several output formats such as KML, GIF, PostScript, ESRI Shapefiles, PDF, GeoTiff, etc; and replace current HYSPLIT Fortran utility programs with equivalent Python scripts to reduce the number of programs requiring compilation. Proficiency with Python required. Will also:",
            "\n",
            "\n•\tMaintain and support all ARL web servers (ARL, READY, READY-TESTBED, WOC) and develop/install/maintain research-to-operations applications on the servers.",
            "\n•\tObtain knowledge of and support/maintain the Local Data Manager (LDM) application used by ARL to process National Weather Service (NWS) text products as well as the “weather” application used to request these products through the ARL READY web server. ",
            "\n•\tAdminister, maintain, and approve messages to the HYSPLIT Forum (phpBB - ",
            ") used by HYSPLIT users to submit questions and comments to HYSPLIT developers.",
            "\n•\tProcess HYSPLIT user registration forms and create READY accounts for these users. Knowledge of Microsoft Excel and Access is needed.",
            "\n•\tAdminister READY (",
            ") by responding to user questions to the ARL Webmaster email address and maintain READY applications in a real-time environment. Update ARL management on web site usage statistics and respond to NWS or user reports of bugs or updates to applications.",
            "\n•\tWork with scientists to develop and install dispersion modelling and meteorological display applications to the READY and/or WOC web servers.",
            "\n•\tInvestigate the feasibility of improving or replacing the HYSPLIT Graphical user Interface (GUI), currently using Tcl/Tk, with Python packages such as Megawidgets, TKinter, etc. Upon approval, replace the GUI in the HYSPLIT system ensuring its operability on the PC, Mac, and LINUX/UNIX platforms.",
            "\n",
            "\nRequired Skills",
            "\n3+ years of experience with web development in support of a physical science program. Must be proficient in scripting languages (batch, ksh, bash, Perl, etc.), Python, and SVN, and have some knowledge of Fortran, C, and Tcl/Tk. Must be proficient in LINUX, Apache installation and maintenance, HTML, KML, CGI applications, and security. Requires experience with HTML, KML, Flash, and ESRI Shapefiles. Must be able to work in Windows, Mac, and LINUX/UNIX environments. Good oral and written communication skills are required. Knowledge of WordPress, GrADS, ImageMagick, Shapefiles, and NCAR Graphics would be desired. Some knowledge of C and Fortran is needed.",
            "\n",
            "\nMust be a US Citizen or Permanent Resident and be able to pass a background investigation to obtain a security badge to enter the applicable government facility.",
            "\n",
            "\nEducation",
            "\nBS in science, engineering, computer science, related discipline, or equivalent. ",
            "\n",
            "\nSubmit resume to ERT's Career Opportunities Web Page at: ",
            "\n",
            "\nEarth Resources Technology, Inc. (ERT)",
            "\nERT is a VEVRAA Federal Contractor and Equal Opportunity/Affirmative Action employer - All qualified applicants will be considered for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status.",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/beltsville-senior-software-engineer/6828691275.html",
        "title": "Senior Software Engineer",
        "date": "2019-02-26 12:56",
        "description": [
            "\n        ",
            "\nJOB TITLE:  Senior Full Stack Software Engineer                                   ",
            "\n",
            "\nJob Description: ",
            "\nOmitron is seeking a full-stack Senior Software Engineer to participate in the software development of message-oriented satellite ground systems.  ",
            "\n",
            "\nThe candidate will work with an established, friendly team of motivated software engineers to develop new, and maintain existing mission operations centers (MOC’s) with particular focus on the mission planning system for several NASA-related projects.  In addition, the candidate will be tightly integrated with members of the flight operations team (FOT) who are users of the system.  Hence, the candidate will receive direct feedback and see immediate impact of their work.  The candidate will also collaborate with other engineers, analysts and system administrators in order to analyze and diagnose and present short-term and long-term solutions.  The candidate should be forward thinking because they will be presented with the opportunity to identify new technologies from public, private, academia and industry practices to improve and support our modernization effort for our current MOC software applications.  The ideal candidate will possess strong development skills as well as strong interpersonal and communication skills.",
            "\n",
            "\n",
            "\nThe candidate shall support the full software development life cycle (SDLC) using established processes for requirements analysis, design, prototyping, coding, unit testing, integration and test, documentation, and sustaining engineering. Responsibilities include:",
            "\n•\tAssisting with the modernization of the mission planning system.",
            "\n•\tPerforming requirements analysis and assessment of the MOC software architecture",
            "\n•\tDeveloping and executing automated unit tests",
            "\n•\tEstimating effort for assigned tasks.",
            "\n•\tParticipating in and presenting at design and code reviews.",
            "\n•\tDeveloping design and code review material, user guides and other system documentation.",
            "\n",
            "\nUS citizenship required.  EEO/AA/E-Verify Participation",
            "\n",
            "\nSkill Requirements:",
            "\n•\tExcellent written and oral communication skills",
            "\n•\tPerforming requirement analysis",
            "\n•\tPresenting design and code reviews and the development of user guides.",
            "\n•\tExperience in C/C++ development.",
            "\n•\tFamiliarity with software version tracking systems such as Subversion and Git.",
            "\n•\tExperience developing for a Linux OS",
            "\n•\tExperience with Atlassian Confluence, JIRA and Bitbucket",
            "\n•\tExperience building and driving automated unit testing initiatives",
            "\n",
            "\n",
            "\nDesired Skills:",
            "\n•\tExperience with Java, Perl and Python programming languages a plus.",
            "\n•\tExperience with web application development using PHP, Ajax and Apache a plus",
            "\n•\tDatabase exposure to MySQL, MariaDB or Mongo DB a plus",
            "\n•\tNASA GMSEC API and associated support applications a plus",
            "\n•\tExperience with ActiveMQ a plus",
            "\n•\tKnowledge of Message Oriented Systems a plus",
            "\n•\tCMMI and ISO 9001 process improvement models",
            "\n•\tNASA software engineering requirements model",
            "\n",
            "\nRequired Experience:           ",
            "\nCandidate must have at least 7-12 years of experience in software development with ever increasing responsibilities. ",
            "\n",
            "\nRequired Degree:      ",
            "\nBS degree in a relevant field (Computer Science, Mathematics, Engineering, or Physical Sciences).",
            "\n",
            "\nJob Location:",
            "\nBeltsville, MD   ",
            "\n",
            "\nCompany Overview: ",
            "\nOmitron is an Aerospace Engineering and Information Technology small business firm headquartered in Beltsville, Maryland with a field office located in Colorado Springs, Colorado. Since 1984 Omitron has provided excellence in engineering services and product development to government and industry customers for both civilian and military aerospace programs.",
            "\n",
            "\nOmitron recognizes that outstanding people are the key to our success. Our goal is to select highly qualified and motivated individuals and provide them an environment necessary to stimulate and nurture engineering and business objectives. Omitron offers its employees competitive salaries, a full benefits package, and excellent career growth opportunities. We welcome talented professionals who wish to take advantage of the opportunities we offer.",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Negotiable"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/arcgis-portal-developer/6829700685.html",
        "title": "ArcGIS PORTAL developer",
        "date": "2019-02-27 16:40",
        "description": [
            "\n        ",
            "\nArcGIS Portal developer",
            "\nUS Citizen ONLY and Active DOD Clearance",
            "\n",
            "\nWe are looking for ESRi ArcGIS PORTAL developer to help develop and integrate GIS into a JAVA application using PORTAL & ArcGIS JS API",
            "\n",
            "\nIf you got experience in ArcGIS Enterprise 10.X, please send us your resume and be ready to showcase your GIS stuff (webmap, storymaps...).",
            "\n",
            "\nUS Citizen ONLY and Active DOD Clearance",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Salary based on experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/fairfax-windows-server-administrator/6830458839.html",
        "title": "Windows Server Administrator",
        "date": "2019-02-28 16:15",
        "description": [
            "\n        ",
            "\nWindows Server Administrator",
            "\n",
            "\n",
            "\nWe're really looking for hands on Windows Server Admin who understands the day in and out functions of the position.  Our client is a Federal Credit Union that provides typical banking solutions for consumers/members all over the greater Washington DC area.  They earn trust from customers/members by:",
            "\n",
            "\n•\tProviding personal, caring service",
            "\n•\tDelivering competitive financial solutions",
            "\n•\tActing in the best interest of members",
            "\n•\tPositively impacting the communities they serve.",
            "\n",
            "\n",
            "\nJob Duties:",
            "\n",
            "\nThe Windows Administrator's role is to design, install, administer, and optimize company servers and related components to achieve high performance of the various business applications supported by tuning the servers as necessary. This includes ensuring the availability of client/server applications, configuring all new implementations, and developing processes and procedures for ongoing management of the server environment. Where applicable, the Windows Admin will assist in overseeing the physical security, integrity, and safety of the data center/server farm. In addition, Windows Admin will apply proven communication, analytical, and problem-solving skills to help identify, communicate, and resolve issues in order to maximize the benefit of IT systems.",
            "\n",
            "\n",
            "\nQualifications:",
            "\n",
            "\n•\t5 years of equivalent work experience. ",
            "\n•\tTechnically fluent in server and NOS administration, including Microsoft Windows Server 2016. ",
            "\n•\tBroad hands-on knowledge of current system software, hardware, protocols, and standards, with Windows",
            "\n•\tKnowledge of applicable data privacy practices and laws; network infrastructures, including LAN, WAN and VPN.",
            "\n•\tWorking knowledge of a range of diagnostic utilities, including Microsoft Active Directory; extensive understanding with TCP/IP and iSCSI network protocols.",
            "\n•\tStrong interpersonal and oral communication skills; Strong organizational skills and excellent attention to detail. ",
            "\n•\tAbility to prioritize and execute tasks in a high-pressure environment",
            "\n",
            "\n- Nice to have experience with Vmware and/or Citrix.",
            "\n",
            "\nGreat if you have Certifications in Microsoft.",
            "\n",
            "\nThis is a long term contract.  We expect the initial term to be at least 6 months, with likelihood that this will go on for a long time.  There is a strong possibility of contract-to-hire for this position if desired.",
            "\n",
            "\nThe hourly rate for this project will be $70-$95/hr based on your level of experience.",
            "\n",
            "\nIf this sounds like you, please respond with your salary requirements as soon as possible.",
            "\n",
            "\nPlease no telecommuters or agencies.",
            "\n",
            "\nThis client, and the associated team are all located in Fairfax VA, and we are looking for candidates that are local to the general area.  You are expected, and will need to be in Fairfax at the office on most days.  Please do not apply if you do not want to be on-site in Virginia.",
            "\n",
            "\n======================================================",
            "\n",
            "\nAbout AAJ Interactive Technologies",
            "\n",
            "\nAAJ Interactive Technologies, established in 1997 by cutting-edge technology executives, is a technology professional-services company supplying project-based consulting, staff augmentation and recruiting services to leading firms throughout Metropolitan Washington, DC area.",
            "\n",
            "\nWe work differently from most of our competition.  We have been in both a position of hiring, mentoring and managing large staffs inside a corporate culture, as well as consultants for hire.  This unique perspective allows us to understand both sides of this business.  We take the time to ensure our consultants/candidates placed will be successful.",
            "\n",
            "\nWe believe that because of our principals we have succeeded where others have failed.  The recruiting/technology space can be full of companies that are not really looking out for your interests - ask around ... we're not one of them!  We want you to succeed, and we'll do everything we can to help you do just that!",
            "\n",
            "\n",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "$70-$95/hr (1099)"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-sr-groovy-ruby-developer/6831310231.html",
        "title": "Sr. Groovy/Ruby Developer",
        "date": "2019-03-01 17:26",
        "description": [
            "\n        ",
            "\nDo you have Full Stack Groovy/Ruby experience?",
            "\n",
            "\nThe Sr. Application Developer is responsible for joining a product team and contributing to the software design, software development, and overall product life-cycle for a product. We are looking for a part time full stack developer who can work with Rack Space UBUNTU handle all the work of databases, servers, systems engineering. Solid experience with Groovy and Grails/ Ruby on Rails and Object Oriented Principles is required.",
            "\n",
            "\nMaintain existing Groovy application (Java tomcat) and migrate the application to Ruby on Rails or other language.",
            "\n",
            "\nThis is a remote position with occasional meetings in the DC area. Candidate will be able to operate independently, as part of a team to create, support, and deploy production applications.",
            "\n",
            "\nQualifications:",
            "\n",
            "\n    Expert in Groovy and Ruby on Rails",
            "\n    Experience with relational databases (MYSQL)",
            "\n    Sr. Level web developer (HTML, CSS, XML, JSON, JavaScript, AJAX, Python, Web browsers)",
            "\n    ",
            "\nMust be authorized to work in the US without sponsorship. ",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n    "
        ],
        "employment_type": "part-time",
        "compensation_type": "$50-$65 per hour"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/falls-church-certified-java-developer/6831895711.html",
        "title": "Certified JAVA Developer & QA Automation Training with Placement!",
        "date": "2019-03-02 13:54",
        "description": [
            "\n        ",
            "\nWe are starting JAVA Developer (Front-End/Back-End/Full Stack); QA Automation/SDET training batch on 03/18/2019 (Mar 18th)!",
            "\n",
            "\nTraining Details:",
            "\nStart Date: 18th March 2019",
            "\nClass Timings: Mon thro Fri / 10.30 AM to 4.30 PM",
            "\nDuration: 6 Weeks",
            "\n",
            "\nBelow are the list of basic requirements to enroll:",
            "\n",
            "\nVisa Status: OPT/H-1B/EAD/GC/USC - Proper Work Authorization to work in USA.",
            "\nEducation: Associate/Bachelor's/Master's",
            "\nComputer science background or programming background is preferred.",
            "\n",
            "\nTraining Curriculum:",
            "\n",
            "\nSelenium, ",
            "\nCore Java",
            "\nAdvance Java, Git- Hub and Maven Dependency",
            "\nRestful API, Web services",
            "\nSpring Boot",
            "\nAPI Testing",
            "\nSpring JDBC",
            "\nHibernet",
            "\nJPA",
            "\nIntroduction to AWS",
            "\nUI development Using Angular JS",
            "\n",
            "\nOBJECTIVES AFTER TRAINING:",
            "\n",
            "\nWe guarantee a JOB AS Junior/Mid-level Java Developer / QA Engineer / SDET(Software Developer Engineer in testing) atone of our numerous client locations.",
            "\n",
            "\nPlease feel free to contact:",
            "\nRaja ",
            "\nAccount Manager",
            "\nM: 571-551-1412",
            "\nE: 703-992-9919 x 3217 ",
            "\n",
            "\nCollaboraIT Inc.",
            "\nwww.collaboraitinc.com ",
            "\n119 Rowell CT, Falls Church, VA -22046",
            "\n",
            "\n",
            "\nAbout CollaboraIT Inc.",
            "\nWith a strong team of 100+ consultants with over 12+ years of experience, we have proven ourselves repeatedly at several Fortune 100 as well as Fortune 500 companies, when it comes to process understanding, collaborative attitude, flawless delivery and end-to-end accountability. CollaboraIT offers a wide-range and best-in-class suite of value-based business solutions comprising of IT services, HR solutions, On-site & Off-site Outsourcing and Consulting services that are built on its robust process domain and people management expertise.",
            "\n",
            "\nWhy CollaboraIT Inc.",
            "\n•\tE verified company",
            "\n•\tStarting salary between $50,000 to $60,000 with regular increments",
            "\n•\tRelocation allowance",
            "\n•\tReferral bonus - On the job support from experienced professionals in the relative field ",
            "\n•\tTravel allowance Insurance- Medical, dental, vision and 401K",
            "\n•\tHealth Benefits through Carefirst BCBS (Blue Cross Blue Shield)    "
        ],
        "employment_type": "contract",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/aspnet-mvc-mssql-developer/6832236680.html",
        "title": "ASP.NET MVC / MSSQL - Developer",
        "date": "2019-03-02 22:18",
        "description": [
            "\n        ",
            "\n",
            " .Net/MVC/SQL developer with 2 years or more experience working on the following.\n\n",
            "\n",
            "\n\n\nThe perfect candidate is someone open to new, innovative technologies with a strong desire to learn. \n\n\n",
            "\n",
            "\n\n",
            "\n",
            "\n",
            "\n",
            "\n\n",
            "    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "Negotiable"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/gaithersburg-oracle-ebs-r12-technical/6832407559.html",
        "title": "Oracle EBS R12 Technical Expert for one year plus",
        "date": "2019-03-03 10:21",
        "description": [
            "\n        ",
            "\nJob Description",
            "\nLocal government agency in Rockville, MD seeks highly-skilled Oracle e-Business Suite R12 technical expert Contract is for one year with the option to extend.   ",
            "\n",
            "\nCandidates must be willing to relocate to Rockville, MD.  Candidates must provide 2 references regarding recent projects.",
            "\n",
            "\nDetails:",
            "\n",
            "\nTitle: Oracle EBS R12 Technical Expert- Warehouse & Order Management",
            "\n",
            "\n# Openings: 1",
            "\n",
            "\nDuration: 1 year with option to extend (will almost definitely extend b/c there is a high workload for this team)",
            "\n",
            "\nInterviews: Client will be doing Skype interviews so we can entertain out of town candidates but please make sure they are not looking for 100% remote work. This role will be onsite with potential for remote days after 6 months or so.",
            "\n",
            "\n***NOTES- Candidates should have the following & needs to be demonstrated clearly and often on their resumes:",
            "\n",
            "\nOracle EBS R12 application knowledge in one or more areas of Financials and/or Supply Chain in a complex ERP enterprise environment. ",
            "\nOracle EBS R12 technical experience:",
            "\nExpert knowledge of PL/SQL or SQL",
            "\nExpert knowledge of workflow, forms and reports",
            "\nSignificant experience with OA Framework and developing solutions using JDeveloper",
            "\nExperience with R12.2 code development standards",
            "\nOracle EBS R12 application knowledge in Order Management and Warehouse Management in a complex ERP environment",
            "\n",
            "\nScope of Work:",
            "\n",
            "\nThis individual may be responsible for, but not limited to, the following: ",
            "\n",
            "\nTroubleshoot production issues and identify and develop solutions;",
            "\nAnalyze and modify code to meet R12.2 coding standards;",
            "\nPerform application development using Oracle Application Framework technology, Oracle Application Development Framework and JDeveloper (Java,J2EE);",
            "\nDiagnose and resolve complex system problems and debug code;",
            "\nPerform technical analysis to resolve issues and streamline operations.",
            "\nSkills/experience preferred includes:",
            "\n",
            "\nExpert knowledge in Oracle EBS Order Management and Warehouse Management.",
            "\nFour to six years application development experience in Oracle EBS R12 applications in a complex environment;",
            "\nSignificant experience with development of Oracle Forms and Reports.",
            "\nSignificant experience developing with OA Framework, Oracle ADF, and JDeveloper (Java/J2EE);",
            "\nDevelopment experience with Mobile Application Framework (MAF);",
            "\nExpert knowledge and experience with R12.2 code development standards;",
            "\nExpert knowledge of PL/SQL or SQL;",
            "\nExpert knowledge in diagnosing and resolving complex system problems, troubleshooting production issues and debugging code;",
            "\nAbility to work under pressure and meet deadlines;",
            "\nStrong verbal, written and interpersonal communication skills.",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "$75-$90 per hour"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/arlington-cto-position-equity-share-in/6832693345.html",
        "title": "CTO Position/Equity Share in Startup - Software Developer Needed",
        "date": "2019-03-03 16:26",
        "description": [
            "\n        ",
            "\nI'm looking for an experienced, motivated, abstract-thinking Software Developer (backend/frontend) to partner with on a startup venture based in the Washington DC area to provide critical software product solutions to government and private sector clients in the defense, space, and national security arenas. Passion and entrepreneurism are required. Big-data experience is a plus. Candidate will serve as the company's CTO and chief developer. I'm looking for a partner, not an employee. If interested, message me with a short intro, a little on your experience (technical, education, business), and we can take it from there. I'm also interested in connecting with entrepreneurs, investors, and mentors.    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "Equity Share"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/springfield-software-developer-agile/6832789856.html",
        "title": "Software Developer (Agile)",
        "date": "2019-03-03 18:44",
        "description": [
            "\n        ",
            "\nSoftware developers needed with Agile background",
            "\nMust have hands on experienced in Development Testing, Validation Testing, Implementation Testing, Operational Testing, and Project Defined Testing with use of Agile",
            "\nMust be able to differentiate between Agile and Waterfall methodogy",
            "\nMust have at least 10 years of experience",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "tbd"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/arlington-sql-server-ssis-ssrs-net/6833086193.html",
        "title": "SQL SERVER SSIS SSRS & .NET TRAINING and 100% JOB PLACEMENT",
        "date": "2019-03-04 09:49",
        "description": [
            "\n        ",
            "\n",
            "\n",
            "\n",
            " \n� 100% Placement Assistance for our consultants. ",
            "\n� Free orientation/Demo class.",
            "\n� Resume Building and Technical screening by the marketing team.",
            "\n� Mock interviews for the candidates ",
            "\n� Placement Assistance with our clients in full time or consulting positions.",
            "\n� Support will be provided while you are in the project",
            "\n� H1B sponsorship and GC for qualified employees.",
            "\n� Free Training to upgrade your skills anytime for our employees.",
            "\n� Excellent marketing team for job placements. ",
            "\n\n",
            "\n",
            "\n==============",
            "==================",
            "\n",
            "\n",
            "\n",
            "\n•\tThe Basic Architecture of SQL Server",
            "\n•\tSQL Server Editions and Versions",
            "\n•\tGetting Started with SQL Server Management Studio",
            "\n",
            "\n",
            "\n•\tWriting Simple SELECT Statements",
            "\n•\tEliminating Duplicates with DISTINCT",
            "\n•\tUsing Column and Table Aliases",
            "\n•\tWriting Simple CASE Expressions",
            "\n",
            "\n",
            "\n•\tUnderstanding Joins",
            "\n•\tQuerying with Inner Joins",
            "\n•\tQuerying with Outer Joins",
            "\n•\tQuerying with Cross Joins and Self Joins",
            "\n",
            "\n",
            "\n•\tSorting Data",
            "\n•\tFiltering Data with a WHERE Clause",
            "\n•\tFiltering with the TOP and OFFSET-FETCH Options",
            "\n•\tWorking with Unknown and Missing Values",
            "\n",
            "\n",
            "\n•\tIntroducing SQL Server 2014 Data Types",
            "\n•\tWorking with Character Data",
            "\n•\tWorking with Date and Time Data",
            "\n",
            "\n",
            "\n•\tInserting Data",
            "\n•\tModifying and Deleting Data",
            "\n",
            "\n",
            "\n•\tWriting Queries with Built-In Functions",
            "\n•\tUsing Conversion Functions",
            "\n•\tUsing Logical Functions",
            "\n•\tUsing Functions to Work with NULL",
            "\n",
            "\n",
            "\n•\tUsing Aggregate Functions",
            "\n•\tUsing the GROUP BY Clause",
            "\n•\tFiltering Groups with HAVING",
            "\n",
            "\n",
            "\n•\tWriting Self-Contained Subqueries",
            "\n•\tWriting Correlated Subqueries",
            "\n•\tUsing the EXISTS Predicate with Subqueries",
            "\n",
            "\n",
            "\n•\tWriting SSIS Package Using Different Data Source",
            "\n",
            "\n",
            "\n•\tGenerate SSRS Report",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n\n==============",
            "==================",
            "\n",
            "\n",
            "\n",
            "\n•\tOverview of Writing Applications using C#",
            "\n•\tDatatypes, Operators, and Expressions",
            "\n•\tC# Programming Language Constructs",
            "\n",
            "\n",
            "\n•\tCreating and Invoking Methods",
            "\n•\tCreating Overloaded Methods and Using Optional and Output Parameters",
            "\n•\tHandling Exceptions",
            "\n•\tMonitoring Applications",
            "\n",
            "\n",
            "\n•\tImplementing Structs and Enums",
            "\n•\tOrganizing Data into Collections",
            "\n•\tHandling Events",
            "\n",
            "\n",
            "\n•\tCreating Classes",
            "\n•\tDefining and Implementing Interfaces",
            "\n•\tImplementing Type-safe Collections",
            "\n",
            "\n",
            "\n•\tCreating Class Hierarchies",
            "\n•\tExtending .NET Framework Classes",
            "\n•\tCreating Generic Types",
            "\n",
            "\n",
            "\n•\tReading and Writing Files",
            "\n•\tSerializing and Deserializing Data",
            "\n•\tPerforming I/O Using Streams",
            "\n",
            "\n",
            "\n•\tCreating and Using Entity Data Models",
            "\n•\tQuerying Data by Using LINQ",
            "\n•\tUpdating Data by Using LINQ",
            "\n",
            "\n",
            "\n•\tAccessing Data Across the Web",
            "\n•\tAccessing Data in the Cloud",
            "\n",
            "\n",
            "\n•\tImplementing Multitasking by using Tasks and Lambda Expressions",
            "\n•\tPerforming Operations Asynchronously",
            "\n•\tSynchronizing Concurrent Access to Data",
            "\n",
            "\n",
            "\n•\tCreating and Using Dynamic Objects",
            "\n•\tManaging the Lifetime of Objects and Controlling Unmanaged Resources",
            "\n",
            "\n",
            "\n•\tImplementing Symmetric Encryption",
            "\n•\tImplementing Asymmetric Encryption",
            "\n",
            "\n",
            "\n•\tIntroduction to the .NET Framework",
            "\n•\tOverview of ASP.NET",
            "\n•\tOverview of the Lab Application",
            "\n",
            "\n",
            "\n•\tChoosing a Programming Language",
            "\n•\tOverview of Visual Studio 2017",
            "\n•\tCreating a Simple Web Application",
            "\n",
            "\n",
            "\n•\tCreating Web Forms",
            "\n•\tAdding and Configuring Server Controls in a Web Form",
            "\n",
            "\n",
            "\n•\tWorking with Code-Behind Files",
            "\n•\tHandling Server Control Events",
            "\n•\tCreating Classes and Components by Using Visual Studio 2010",
            "\n•\tHandling Page Events",
            "\n",
            "\n",
            "\n•\tCreating Master Pages",
            "\n•\tAdding User Controls to an ASP.NET Web Form",
            "\n",
            "\n",
            "\n•\tOverview of User Input Validation",
            "\n•\tASP.NET Validation Controls",
            "\n•\tValidating Web Forms",
            "\n",
            "\n",
            "\n•\tDebugging in ASP.NET",
            "\n•\tTracing in ASP.NET",
            "\n",
            "\n",
            "\n•\tOverview of ADO.NET",
            "\n•\tConnecting to a Database",
            "\n•\tManaging Data",
            "\n",
            "\n",
            "\n•\tOverview of LINQ",
            "\n•\tManaging XML Data by Using LINQ to XML",
            "\n•\tManaging SQL Data by Using LINQ to SQL and LINQ to Entities",
            "\n",
            "\n",
            "\n•\tOverview of ASP.NET Dynamic Data",
            "\n•\tApplying ASP.NET Dynamic Data",
            "\n•\tCustomizing ASP.NET Dynamic Data Applications",
            "\n",
            "\n",
            "\n•\tIntroduction to Ajax",
            "\n•\tCreating an ASP.NET Ajax Application by Using the Ajax Features for ASP.NET",
            "\n•\tExtending an ASP.NET Web Forms Application by Using the Ajax Control Toolkit",
            "\n",
            "\n",
            "\n•\tOverview of Windows Communication Foundation Services",
            "\n•\tCalling Windows Communication Foundation Services",
            "\n•\tWorking with WCF Data Services",
            "\n",
            "\n",
            "\n•\tState Management",
            "\n•\tASP.NET Profiles",
            "\n•\tASP.NET Caching",
            "\n",
            "\n",
            "\n•\tConfiguring an ASP.NET Web Application",
            "\n•\tDeploying an ASP.NET Web Application",
            "\n",
            "\n",
            "\n•\tOverview of Web Application Security",
            "\n•\tDeclaratively Configuring Authentication and Authorization",
            "\n•\tWorking Programmatically with Authentication and Authorization",
            "\n",
            "\n",
            "\n•\tOverview of Microsoft Web Technologies",
            "\n•\tOverview of ASP.NET 4.5",
            "\n•\tIntroduction to ASP.NET MVC 6",
            "\n",
            "\n",
            "\n•\tPlanning in the Project Design Phase",
            "\n•\tDesigning Models, Controllers, and Views",
            "\n",
            "\n",
            "\n•\tCreating MVC Models",
            "\n•\tWorking with Data",
            "\n",
            "\n",
            "\n•\tWriting Controllers and Actions",
            "\n•\tWriting Action Filters",
            "\n",
            "\n",
            "\n•\tCreating Views with Razor Syntax",
            "\n•\tUsing HTML Helpers",
            "\n•\tReusing Code in Views",
            "\n",
            "\n",
            "\n•\tUnit Testing MVC Components",
            "\n•\tImplementing an Exception Handling Strategy",
            "\n",
            "\n",
            "\n•\tAnalyzing Information Architecture",
            "\n•\tConfiguring Routes",
            "\n•\tCreating a Navigation Structure",
            "\n",
            "\n",
            "\n•\tUsing Template Views",
            "\n•\tApplying CSS to an MVC Application",
            "\n•\tCreating an Adaptive User Interface",
            "\n",
            "\n",
            "\n•\tUsing AJAX and Partial Page Updates",
            "\n•\tImplementing a Caching Strategy",
            "\n",
            "\n",
            "\n•\tRendering and Executing JavaScript Code",
            "\n•\tUsing jQuery and JQueryUI",
            "\n",
            "\n",
            "\n•\tImplementing Authentication and Authorization",
            "\n•\tAssigning Roles and Membership",
            "\n",
            "\n",
            "\n•\tDeveloping Secure Sites",
            "\n•\tState Management",
            "\n",
            "\n",
            "\n•\tIntroducing web service",
            "\n•\tDesigning and Writing Windows web Services",
            "\n•\tConsuming Windows web Services in a Web Application",
            "\n",
            "\n",
            "\n•\tDeveloping a Web API",
            "\n•\tCalling a Web API from Mobile and Web Applications",
            "\n",
            "\n",
            "\n•\tUsing HTTP Modules and HTTP Handlers",
            "\n•\tUsing Web Sockets",
            "\n",
            "\n",
            "\n•\tDeploying a Web Application",
            "\n•\tDeploying an MVC 5 Application",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/edgewater-front-end-developer-graphic/6833142160.html",
        "title": "Front End Developer/ Graphic and Web Designer/ IT",
        "date": "2019-03-04 10:51",
        "description": [
            "\n        ",
            "\n****NO FREELANCERS OR SUBCONTRACTORS****",
            "\n",
            "\n~APPLICANT MUST REPORT FOR WORK DAILY AT OUR LOCAL EDGEWATER, MD LOCATION",
            "\n",
            "\n",
            "\n",
            "\nFront End Developer ~Graphic and Web Designer – Full time, salaried position, salary is negotiable depending on experience.",
            "\nAre you a motivated self-starter with a knack for creativity? Do you find challenge refreshing and intriguing? ",
            "\n",
            "\nThe Real Estate Corner is seeking a result driven individual to build and manage our online and media presence. Your creativity and out of the box thinking will come in handy to create and maintain brand recognition and awareness. You will be assigned a wide variety of tasks varying from graphic design to building and maintaining a subscription-based Word Press platform.",
            "\n",
            "\nAbout Us:",
            "\nThe Real Estate Corner is a unique One Stop Shop for all Real Estate and Home Improvement needs. We take the hassle out of finding a local agent to sell your home, or a local repairman to come fix a leak by bringing those search capabilities to just one website. If you would enjoy being a part of a startup internet platform and coming up with new ideas to grow and take the business to the next level, we are looking for you!",
            "\nDuties include but are not limited to: ",
            "\nMaintaining and servicing existing website, database, backend, E-Commerce, etc.",
            "\nDesigning, and updating to existing website on Word Press.",
            "\nStrategizing, planning, executing new ideas for growth of startup platform.",
            "\nStrategizing, planning, executing marketing campaigns on Google, Social Media platforms, LinkedIn, and other services.",
            "\nCreative designing for marketing campaigns.",
            "\nBuilding email campaigns for new and existing customers.",
            "\nHandling customer and IT support for help with checkout and E-Commerce processes.",
            "\n",
            "\nRequirements:",
            "\nBachelor’s degree in Business/Marketing.",
            "\nMinimum of 5 years’ professional experience in marketing, media, social media marketing, e-commerce, web development, and web design.",
            "\nMust have knowledge and proficiency with Word Press.",
            "\nBackground in graphic design",
            "\n",
            "\n",
            "\nAdditional Qualifications:",
            "\nExcellent interpersonal communication, organizational, multitasking, and computer skills.",
            "\nAbility to be proactive, detail oriented, highly motivated, meet deadlines, and handle a fast-paced environment.",
            "\nAbility and desire to work both independently, and as a part of a team.",
            "\nStrong writing, editing and outreach skills are necessary. Must not be afraid of cold calling to establish new relationships. ",
            "\n",
            "\nThe Real Estate Corner is an Equal Opportunity employer who takes pride in recruiting qualified applicants without regard to race, color, religion, gender, age, ethnic or national origin, protected veteran status, physical or mental disability, sexual orientation, gender identity, marital status, or citizenship status.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Neg Depending on Experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/sterling-software-engineer-permanent/6833155038.html",
        "title": "Software Engineer - Permanent, Full Time, Benefits!!",
        "date": "2019-03-04 11:04",
        "description": [
            "\n        ",
            "\nAPPLY DIRECTLY TO THE WEBSITE FOR IMMEDIATE CONSIDERATION: ",
            "\n",
            "\nGlobal Wireless Solutions, Inc. (GWS) a wireless engineering company is seeking a Software Engineer to join its team in Dulles, Virginia. GWS offers highly motivated individuals a technically challenging environment, competitive compensation and outstanding benefits package. In this full-time Software Engineer position at $75,000-$95,000, your duties will include, but are not limited to the following: ",
            "\n",
            "\nPRIMARY DUTIES AND RESPONSIBILITIES (BUT NOT LIMITED TO):",
            "\n-Design, develop, test, document and implement technical applications and application enhancements to the GWS' internal system, such as Benchmarking report system for RF test drive data",
            "\n-Customize software tools for each wireless networking provider's needs and specifications",
            "\n-Utilize wireless communications protocols such as: CDMA, GSM, EDGE, UMTS, HSPA, 1xRTT, 1xEVDO and WiMax",
            "\n-Work closely with the RF Engineering team to implement the means by which to measure network carrier performance and developing and testing these applications using VB.NET, VBA, console applications and SQL Server",
            "\n-Assist other departments to troubleshoot and provide solutions to technical problems",
            "\n ",
            "\n",
            "\nEDUCATION AND EXPERIENCE REQUIREMENTS:",
            "\n-Minimum of Bachelor’s degree in Computer Science required ",
            "\n-Minimum of 3 years professional software experience required",
            "\n-Excellent knowledge of VB.NET, VBA, C# and SQL",
            "\n-Preferred knowledge of CDMA, GSM, EDGE, UMTS, HSPA, 1xRTT, 1xEVDO, WiMax and .NET framework",
            "\n-Attention to detail, good organizational skills and excellent interpersonal skills",
            "\n-Excellent oral and written communication skills",
            "\n-Excellent knowledge of Microsoft Office",
            "\n-Ability to multi-task and quickly adapt to changing priorities with a sense of urgency when needed",
            "\n-Must be willing to comply with GWS' drug testing policy",
            "\n ",
            "\nGlobal Wireless Solutions, Inc. is an Equal Employment Opportunity employer M/F/D/V",
            "\n",
            "\nAPPLY DIRECTLY TO THE WEBSITE FOR IMMEDIATE CONSIDERATION: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "$75,000 - $95,000"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/sterling-rf-analyst-permanent-full-time/6833161381.html",
        "title": "RF Analyst - Permanent, Full Time, Benefits!!",
        "date": "2019-03-04 11:10",
        "description": [
            "\n        ",
            "\nAPPLY DIRECTLY TO THE WEBSITE FOR IMMEDIATE CONSIDERATION: ",
            "\n",
            "\n",
            "\nGlobal Wireless Solutions, Inc. (GWS) a wireless engineering company is seeking a RF Analyst to join its team in Dulles, Virginia. GWS offers highly motivated individuals a technically challenging environment, competitive compensation and outstanding benefits package. In this full-time RF Analyst position at $65,000/year, your duties will include, but are not limited to the following:",
            "\n",
            "\nPRIMARY DUTIES AND RESPONSIBILITIES (BUT NOT LIMITED TO):",
            "\n",
            "\n-Analyze daily benchmark data and identify irregularities.",
            "\n-Review and analyze all call events and QA summaries.",
            "\n-Analyze various technologies including CDMA, GSM, WCDMA, HSPA+, EvDO, & LTE.",
            "\n-Validate negative call events in assigned markets.",
            "\n-Identify, track and report problems and collaborate with Team Leads to resolve issues with benchmark data.",
            "\n-Review market level data and identify possible action items to resolve negative call events.",
            "\n-Generate summary reports and analysis presentations for clients.",
            "\n ",
            "\n",
            "\nEDUCATION AND EXPERIENCE REQUIREMENTS:",
            "\n-Minimum of Bachelor's degree in Electrical Engineering or Telecommunications with 2 years of experience.",
            "\n-Ability to work well with a variety of people.",
            "\n-Excellent verbal and written communication sills",
            "\n-Must be independent and have strong initiative.",
            "\n-Proficient with Microsoft Office applications, MapInfo, data collection software, RF analysis tools software.",
            "\n-Ability to work extended hours, day and/or night schedule.",
            "\n-Must be willing to comply with GWS's drug testing policy.",
            "\n ",
            "\nGlobal Wireless Solutions, Inc. is an Equal Employment Opportunity employer M/F/D/V",
            "\n",
            "\nAPPLY DIRECTLY TO THE WEBSITE FOR IMMEDIATE CONSIDERATION: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "$65,000"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-software-engineering-fellow/6834203798.html",
        "title": "Software Engineering Fellow",
        "date": "2019-03-05 14:28",
        "description": [
            "\n        ",
            "\nWhat is Pathrise",
            "\n",
            "\nPathrise (YC W18) invests in undervalued university students or young professionals by coaching them to get a competitive internship or job. The program is completely free upfront. In exchange, Pathrise fellows agree to pay back a share of their first year's salary if and only if they get hired.",
            "\n",
            "\nPathrise is based on insights from hundreds of hiring managers in tech; this means everyone from Google recruiters to startup CEOs. We've been featured in TechCrunch, VentureBeat, EdSurge, and The Atlantic as the \"Y Combinator for your career.\" To date, we've worked with over 130 fellows and have helped them land offers at Facebook, Uber, Google, Oath, Amazon, and other top companies or exciting startups.",
            "\n",
            "\nAbout the Fellowship",
            "\n",
            "\nThe Pathrise Fellowship is a program for students and new grads that helps you land the best job or internship possible in tech.",
            "\n",
            "\nDuring the fellowship, you receive 1-on-1 mentorship from experienced industry engineers, analysts, managers, and recruiters. You learn systems to attract the attention of any company you want, find out insider information on how to ace your interviews, and more. We even directly refer you to companies in our network until you find a job you love.",
            "\n",
            "\nOur Mission",
            "\n",
            "\nWe seek to uplift and provide guidance for undervalued students and young professionals in their early career. You can read more about our mission and how it all works on our website: www.pathrise.com.",
            "\n",
            "\nQualifications",
            "\n",
            "\nYou are either in university or within 5 years of graduation, and interested in getting the best possible job.",
            "\nYou want to work with an experienced advisor who can give you expert advice whether you need to learn about data structures or UI/UX patterns.",
            "\nYou are eager to start your career with a job or internship at a top tech company or a rapidly growing startup.",
            "\nYou want a team of advisors who will be by your side throughout the entire process, whenever you need, as long as you need.",
            "\n",
            "\nPlease apply here: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "80,000-160,000"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/rockville-web-project-manager/6833305549.html",
        "title": "Web Project Manager",
        "date": "2019-03-04 13:22",
        "description": [
            "\n        ",
            "\nfusionSpan has been providing exceptional technology consulting, implementation, development,  and support services to nonprofit associations since 2010. ",
            "\n",
            "\nWe are seeking a talented Web Project Manager to join our growing team. This position provides organization and structure to projects, promotes communication between teams, seeks out ways to improve existing systems, and streamlines processes. The Project Manager interacts with clients, senior managers, and technical staff to provide consistent communication and updates on project performance, schedules, and resources to external stakeholders.",
            "\n",
            "\nThe right person will be self-motivated and adaptable. This position requires someone who wants their work to make a difference, is a fast learner, has an instinctive problem solving mentality, and experience conceptualizing and creating out of the box solutions",
            "\n",
            "\nResponsibilities:",
            "\n-Assist with execution of small and large IT projects",
            "\n-Understand and document complex technical requirements",
            "\n-Prepare and update project plans and status reports",
            "\n-Act as liaison with project stakeholders and the development team",
            "\n-Assist with technical solution crafting",
            "\n-Oversee the helpdesk",
            "\n-Ensure high levels of client satisfaction",
            "\n",
            "\nRequired Skills:",
            "\n-Strong communication and interpersonal skills required",
            "\n-Willingness to learn new technology tools",
            "\n-Ability to multitask and prioritize multiple projects and deadlines",
            "\n-Team player who is also a self-starter and can work independently",
            "\n-Detail-oriented and organized",
            "\n",
            "\nWe offer a comprehensive salary and benefits package, as well as a challenging, but low stress environment with no corporate hierarchy.  This position is located around Rockville, MD and is a five-minute walk from the Twinbrook Metro Station.",
            "\n",
            "\nAll our positions provide the following benefits:",
            "\n-3% of salary in a 401k account",
            "\n-3 weeks paid vacation",
            "\n-100% paid Medical, dental and vision insurance",
            "\n-Portable computer",
            "\n-Mass transit allowance",
            "\n-Flexible schedule",
            "\n",
            "\n",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/entry-level-java-j2ee-developer-needs/6833326615.html",
        "title": "Entry Level Java/J2EE Developer (Needs relocation) (Washington DC)",
        "date": "2019-03-04 13:42",
        "description": [
            "\n        ",
            "\nLocation: Multiple Locations",
            "\nEmployment Type: Full Time ",
            "\n",
            "\nApply Here: ",
            "\n",
            "\nDesign and develop software systems using object oriented design, Java, .Net or Cloud programming languages. Develop unit and integration test procedures. Work independently and work with team members in an agile and fast- paced development environment under the direction and supervision of a senior technical lead. Assist with troubleshooting and bug fixing of Web-based systems. Write documentation of new or existing programs to ensure effective communication.",
            "\n",
            "\n",
            "\nBASIC QUALIFICATIONS:",
            "\n- Bachelor's/ Master's Degree in Computer Science or equivalent training/work experience; maximum work experience of 3 years",
            "\n- Experience writing and executing unit and integration tests.",
            "\n- Knowledge of Java, C#, .Net, Python, or similar programming languages.",
            "\n- Web programming and knowledge of Object Oriented design and design partners.",
            "\n",
            "\nADDITIONAL QUALIFICATIONS:",
            "\n- Experience with Model View Controller (MVC) applications using Spring MVC or similar frameworks",
            "\n- Experience with SQL queries and any relational database systems",
            "\n",
            "\nBENEFITS:",
            "\n- Pay Package -- $52K-$82K",
            "\n- Full Medical and Health Benefits",
            "\n- 401K",
            "\n- Periodic Performance Bonus",
            "\n- Full Relocation Package",
            "\n- OPT/CPT/EAD/US Citizens/GC Holders Accepted",
            "\n",
            "\nThis is a great opportunity for an entry level or Junior Developer that wants to be mentored by a team of Senior Development professionals. Candidates must be smart, articulate, have a passion for software development, be customer focused, and have a strong desire to learn and remain current on a wide range of development technologies.",
            "\n",
            "\nWe are proud of our diverse environment, EOE,M/F/D/V.",
            "\nPrincipals only. Recruiters, please don't contact this job poster.",
            "\ndo NOT contact us with unsolicited services or offers    "
        ],
        "employment_type": "full-time",
        "compensation_type": "$52K-$82K"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/falls-church-meet-40-top-employers-at/6833347663.html",
        "title": "Meet 40+ Top Employers at the National Capital Region Job Fair on 3/11",
        "date": "2019-03-04 14:02",
        "description": [
            "\n        ",
            "\nCome to the National Capital Region Job Fair on March 11 to connect with over 40 DC/VA/MD-area companies and government agencies.",
            "\n",
            "\nYou’ll meet recruiters seeking talented individuals of all skill levels (from students to experienced professionals) across a broad variety of disciplines, including security cleared positions. ",
            "\n",
            "\nCompanies include: Accenture, CIA,  ITAC, Specialized Engineering, Software AG, NSA, USPTO, Aurora Flight Sciences, FDA, U.S. Department of State, GSK, Merritt Group, Enterprise and many more.",
            "\n",
            "\nSee a full list and register at ",
            "\n",
            "\nThe fair is conveniently located adjacent to the West Falls Church Metro Station. All area job seekers are welcome to this free event, including current students. Register soon to ensure your resume is sent to companies ahead of time!",
            "\n",
            "\nExperienced Hire Registration (>1 year of professional experience): ",
            "\n",
            "\nCollege Hire Registration (Individuals still in college or graduated < 1 year ago): ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Varies by company"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/beltsville-software-developer-entry/6833987822.html",
        "title": "Software Developer (Entry-Level)",
        "date": "2019-03-05 11:06",
        "description": [
            "\n        ",
            "\nLooking for a collaborative, fun company with room for growth?",
            "\n",
            "\nIMS, Inc. is a recognized leader in the biomedical IT field, with clients including the NCI, CDC, & major pharmaceutical firms. We are a diverse group of people with a focus on product quality, customer satisfaction, & enjoying what we do. We have a relaxed, friendly work environment, where employees are recognized for the work that they do. Add to that work/life balance, social events, casual dress, & no cubicles- that's why many employees have stayed with us.",
            "\n",
            "\nJoin us as a Software Developer & see what makes IMS such a unique place to work!",
            "\n",
            "\nAs a Software Developer (Entry-Level), you will: ",
            "\n• Design and develop n-tier applications for new products or enhancements to existing products using multiple languages and design methodologies",
            "\n• Translate requirements into viable code",
            "\n• Test and debug code",
            "\n• Prepare documentation following company standards and applicable regulations",
            "\n• Perform other software development related duties as assigned",
            "\n",
            "\nTo be eligible for this position, you must meet the following requirements:",
            "\n• BA/BS in CompSci or related field from a U.S. DOE accredited institution with a 2.9+ GPA",
            "\n• 0-5 years of related experience",
            "\n• Knowledge of at least one programming language (Java, Python, C++, etc.)",
            "\n• Knowledge of current web user interfaces",
            "\n• Knowledge of current development technologies & environments",
            "\n• Demonstrated strong verbal & written communication skills",
            "\n• Demonstrated ability to relay technical information to clients & users in layman terms",
            "\n• Demonstrated strong problem-solving & analytical skills",
            "\n• Demonstrated customer service skills",
            "\n• Excellent attention to detail & organization skills",
            "\n• Must be able to multi-task, meet deadlines, & work within a team",
            "\n• Strong presentation skills preferred",
            "\n",
            "\nIf this sounds like the right position for your career, apply today at: ",
            ".  ",
            "\n",
            "\nIMS is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristic protected by applicable law.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive, Commensurate with Experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/seattle-senior-splunk-developer/6834005553.html",
        "title": "Senior Splunk Developer Opportunity in Seattle",
        "date": "2019-03-05 11:24",
        "description": [
            "\n        ",
            "\nAffirma is an award-winning software services consulting company, ranked in Seattle Business “100 Best Companies to Work For” is looking for a Senior Splunk Developer to join a public safety solutions client of ours in Belltown! If you can see the big picture, and get excited about working in DevOPS environment to generate mission critical data analysis/reports then please, read on!",
            "\n",
            "\nThis role is a 6-month contract to permanent position where you would have the opportunity to work with the best and brightest engineers, in an environment that is rewarding and collaborative. You will help us reinvent reporting and monitoring using Splunk capabilities to improve visibility and usability. You will work on architecting and developing solutions for reporting. As a Senior Splunk Developer, you will participate in all tasks required to maintain application availability, responsiveness, and functionality. You will identify and complete work to improve application maintainability, availability, and responsiveness.",
            "\n",
            "\nResponsibilities",
            "\n•\tUnderstand requirements, participating in creating/ proposing solutions",
            "\n•\tDesign and develop Splunk reports, dashboards, applications",
            "\n•\tDevelop proof or concepts and alternate applications of existing solutions for different business scenarios",
            "\n•\tProvide technical support and assistance to users as appropriate",
            "\n•\tTroubleshoot supported applications including web, client-server, and database components",
            "\n•\tCreate and maintain configuration documentation for all assigned systems using Enterprise Architect and Visio.",
            "\n•\tAdhere to our documented software development practices for design, development, testing, and deployment.",
            "\n•\tWork in a pure DevOPS model with end to end visibility ",
            "\n•\tComplete assignments in work request queue in a timely manner.",
            "\n•\tParticipate in on-call support for 24x7 production environments and after hours support as necessary.",
            "\n",
            "\nRequirements",
            "\n•\tMUST be willing to relocate to Seattle",
            "\n•\tHighly proficient in Splunk administration ",
            "\n•\tHighly proficient in SPL and creating reports/dashboards",
            "\n•\tHighly proficient in UNIX/Linux environment and shell scripting",
            "\n•\tProgramming experience required (Java, Python preferred)",
            "\n•\tMinimum 1 year of hands-on SQL development, write SQL, PLSQL, table joins and proficiency with SQL and MySQL or Oracle database servers.",
            "\n•\tMinimum 1 year of hands-on JavaScript/CSS experience.",
            "\n•\tProficiency/Knowledge in big data or schema-less technologies like Hadoop, Spark, MongoDB is a plus",
            "\n•\tExperience performing deployments of Splunk configurations to support data onboarding and other maintenance/upgrade activities",
            "\n•\tStrong written and oral communication skills",
            "\n•\tAbility to work well under pressure",
            "\n•\tProven ability to individually manage work while multitasking",
            "\n•\tHighly energetic with a positive attitude with a keen focus on quality deliverables",
            "\n•\tBachelors Degree from a four-year college or equivalent work experience",
            "\n",
            "\n",
            "\nNice to have",
            "\n•\tTroubleshooting/Supporting web applications experience ",
            "\n•\tWireless, Telecommunication, or Internet industry experiences",
            "\n",
            "\nInterested in this position? Head to ",
            " and submit your application using the job opening ID #817!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/ba-qabusiness-analyst-quality-analyst/6833201496.html",
        "title": "BA/QA(BUSINESS ANALYST/QUALITY ANALYST) TRAINING & 100% JOB PLACEMENT",
        "date": "2019-03-04 11:48",
        "description": [
            "\n        ",
            "\nBA/QA(BUSINESS ANALYST/QUALITY ANALYST) TRAINING & 100% JOB PLACEMENT",
            "\n",
            "\n",
            "\nFor more information please call 732 250 3906",
            "\n",
            "\nDemo Introduction Video: www.youtube.com/watch?v=SHj5bH6VTu8",
            "\n",
            "\n",
            "\nWe offer a Combo BA/QA Course where the students can learn the concepts of BA/QA in the same Program with out any additional effort. This also gives the flexibility for the students to choose the best Career option...BA or QA at the end of the course.",
            "\n",
            "\n100% JOB PLACEMENT ASSISTANCE RECORD. ALSO SPECIALIZE IN JOBS PLACEMENTS IN NJ,NY as we work mostly with LOCAL CLIENTS in EAST COAST.",
            "\n",
            "\nWe offer detailed ,comprehensive and Job Oriented training in Business Analyst/Quality Analysis with Placement Assistance.",
            "\nFlexible timings on Weekdays/Weekends",
            "\nProfessional guidance for resume preparation and interviews",
            "\nCounseling/One-on-one discussion with Trainer to clarify your doubts.",
            "\nFlexible timings for the training.",
            "\nAggressive marketing by experienced placement team",
            "\nH1b and Green cards sponsorship for deserving candidates",
            "\nTraining for Certifications and Reimbursement for Certifications on a need basis.",
            "\nProfessional Training and training material.",
            "\nWe are currently looking for Citizens/GC holders/OPT/CPT holders/ H1B",
            "\nWe provide excellent benefits like",
            "\n",
            "\nCompetitive Salary or hourly rates.",
            "\nHealth Insurance.",
            "\nCorporate training opportunities",
            "\nJob Placement",
            "\nResume Preparation",
            "\nDiscussion on Interview Questions",
            "\nJob Placement Support",
            "\nOn Job Support",
            "\n",
            "\n",
            "\nFor more information please call 732 250 3906",
            "\nQA Testing Course Content",
            "\nIntroduction to Software Testing",
            "\n• What is Software Testing?",
            "\n",
            "\nSoftware Development Life cycle",
            "\n• Requirements",
            "\n• Analysis",
            "\n• Design",
            "\n• Coding",
            "\n• Testing",
            "\n• Acceptance",
            "\n",
            "\nSDLC Models",
            "\n• Agile",
            "\n• Waterfall model",
            "\n• Spiral model",
            "\n• V-Model",
            "\n",
            "\nTesting-Methods",
            "\n• White Box Testing",
            "\n• Black Box testing",
            "\n• Gray Box testing",
            "\n",
            "\nTypes of Testing (Black Box Testing)",
            "\n• Build Verification Testing",
            "\n• Functional Testing",
            "\n• Integration Testing",
            "\n• Regression Testing",
            "\n• System Testing",
            "\n• Acceptance Testing",
            "\n• Smoke and Sanity Testing",
            "\n• Ad-hoc Testing",
            "\n• Exploratory Testing",
            "\n• Compatibility Testing",
            "\n• Disaster Recovery Resting",
            "\n• Load, Volume, Stress and Performance Testing",
            "\n",
            "\nTesting Life Cycle / Quality Assurance Life Cycle / Software Testing Life Cycle",
            "\n• Requirements",
            "\n• System study",
            "\n• Test plan",
            "\n• Test Cases",
            "\n• Traceability Matrix",
            "\n• Test case execution",
            "\n• Defect tracking",
            "\n• Test Summary Report",
            "\n• User Acceptance Testing",
            "\n",
            "\nTest Plan",
            "\n• Objective",
            "\n• Scope",
            "\n• Approach",
            "\n• Methodologies",
            "\n• Deliverables",
            "\n• Test environment",
            "\n• Schedule and Resources",
            "\n• Effort and estimation",
            "\n• Entry and Exit criteria",
            "\n• Templates",
            "\n• Risk",
            "\n• Assumption",
            "\n• Contingency Plan",
            "\n• References",
            "\n",
            "\nTest Case",
            "\n• Test Case Design",
            "\n• How to write test cases",
            "\n• When to execute test cases",
            "\n",
            "\nChecklists",
            "\n• How to create checklists",
            "\n• When to use checklists",
            "\n",
            "\nDefect tracking",
            "\n• Defect life cycle",
            "\n• Severity, priority",
            "\n• Defect tracking Tool -- Quality Center, Bugzilla and Rational Clear Quest",
            "\n• Defect report",
            "\n• Defect Tracking Sheet ",
            "\n• OK for recruiters to contact this job poster.",
            "\n• do NOT contact us with unsolicited services or offers",
            "\n",
            "\n",
            "\n•\tOK for recruiters to contact this job poster.",
            "\n•\tdo NOT contact us with unsolicited services or offers",
            "\n",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/herndon-engineer-in-test-test/6834325039.html",
        "title": "Engineer in Test/Test Automation Engineer",
        "date": "2019-03-05 16:37",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking a talented Test Automation Engineers having worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\nRequirements:",
            "\n-  Outstanding communication skills",
            "\n- General Software Testing (System, Regression, Smoke, UAT)",
            "\n- Agile/Scrum team experience",
            "\n- Test planning ",
            "\n- Test data setup and management",
            "\n- Web Browser/Mobile Testing & Compatibility",
            "\n- Ability to understand complex systems and find corner cases",
            "\n- Basic ability to navigate command line of windows and unix operating systems",
            "\n- Ability to edit/change simple shell scripts",
            "\n- Solid SQL knowledge",
            "\n- Test Automation using Selenium or Watir",
            "\n- Load testing with Jmeter, Grinder or Load Runner ",
            "\n- Ability to read code and understand how it works and determine possible errors in it.",
            "\n- Must have at least 5 years experience in the US",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/herndon-quality-assurance-software/6834327705.html",
        "title": "Quality Assurance/Software Tester",
        "date": "2019-03-05 16:40",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking talented Software Testers having worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\nCandidate is a strong software tester with experience in the following:",
            "\n-  Outstanding communication skills",
            "\n- General Software Testing (System, Regression, Smoke)",
            "\n- Agile/Scrum team experience",
            "\n- Test planning ",
            "\n- Test data setup and management",
            "\n- Web Browser/Mobile Testing & Compatibility",
            "\n- Ability to understand complex systems and find corner cases",
            "\n- Basic ability to navigate command line of windows and unix operating systems",
            "\n- Must have at least 5 years experience in the US",
            "\n- Ability to edit/change simple shell scripts",
            "\n- Solid SQL knowledge",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/arlington-java-engineer/6834381807.html",
        "title": "JavaScript Engineer",
        "date": "2019-03-05 17:43",
        "description": [
            "\n        ",
            "\nOverview",
            "\n",
            "\nDriven by the pursuit of the next frontier of healthcare, our clients Digital Product Engineering team is changing the way people feel about, think about and interact with health care through ultra-connected, convenient and personal experiences.  A growing organization within a strong growth company, the Digital Product Engineering team leverages and integrates emerging technologies (AI, NLP/U, AR, IoT) into new and existing channels (web, mobile, SMS, bot, voice) to deliver new experiences poised to change the face of consumer health.  ",
            "\n",
            "\nWith a presence in Clarendon neighborhood of Arlington VA, this tight-knit, interdisciplinary team uses a variety of ideation methods—from design thinking to hackathons—to rapidly prototype and develop new capabilities to address the biggest opportunities and core challenges of healthcare consumption. ",
            "\n",
            "\nPosition Purpose: Provide high level development architectural support and serve as a source of expertise for the programming group.  ",
            "\n",
            "\nYou will:",
            "\n",
            "\n•  Create and modify development process and procedures with the development staff and other IT teams",
            "\n",
            "\n•  Coordinate with IT admin and triage incoming work and insure tasks are assigned across the development team",
            "\n",
            "\n•  Insure development staff adheres to the business unit’s IT processes and procedures",
            "\n",
            "\n•  Provide architecture and code-reviews to members of the team to insure quality",
            "\n",
            "\n•  Provide architectural design and development vision on large projects",
            "\n",
            "\n•  Mentor, provide code-reviews, and overall guidance to junior members of the programming department",
            "\n",
            "\n•  Provide second level of support in applying in-depth knowledge of systems to diagnose problems and find solutions to meet user requirements.",
            "\n",
            "\n•  Coordinate with IS and users to identify programming requirements for development projects and support activities",
            "\n",
            "\n•  Comply with prioritization process to reduce backlog of projects and directs preparation of programs to process data and solve problems",
            "\n",
            "\n",
            "\nQualifications:",
            "\n",
            "\nEducation/Experience: ",
            "\n-Bachelor’s degree in related field or equivalent experience. ",
            "\n-3+ years of experience with modern JavaScript, and associated framework (e.g. Node, React, Angular, etc). ",
            "\n-Working knowledge of current technologies, programming languages, project management, and application development methodologies.",
            "\n ",
            "\nPreferred Exp:",
            "\n•\tStrong Software Development Experience",
            "\n•\tStrong experience in modern programming languages / frameworks (NodeJS, Go, Elixir, Python) highly desired",
            "\n•\tExperience with AI, VR, AR is a plus ",
            "\n•\tDigital health experience is a plus",
            "\n•\tA strong ability to be self-directed, comfortable with change, and willing to try new things",
            "\n",
            "\nThis is a full time employee position working directly for our client.  The pay range target is $120,000 - $145,000/yr plus great benefits.",
            "\n",
            "\nThe work is on-site at our clients’ offices in Clarendon/Courthouse area of Arlington.  ",
            "\n",
            "\nIf this sounds like you, please respond with your salary requirements as soon as possible.",
            "\n",
            "\nPlease no telecommuters or agencies.",
            "\n",
            "\n=====================================",
            "\n",
            "\nAbout AAJ Interactive Technologies:",
            "\n",
            "\nAAJ Interactive Technologies, established in 1997 by cutting-edge technology executives, is a technology professional-services company supplying project-based consulting, staff augmentation, and recruiting services to leading firms throughout Metropolitan Washington, DC area.",
            "\n",
            "\nWe work differently from most of our competition.  In our careers, we have been the ones doing the hiring (managing and mentoring large staffs in a corporate culture), and we have been the ones being hired (consulting in small and large roles alike).  This unique perspective allows us to understand both sides of this business.  We take the time to ensure our consultants/candidates will be successful where they are placed.",
            "\n",
            "\nWe believe that because of our principles we have succeeded where others have failed.  The recruiting/technology space can be full of companies that are not really looking out for your interests – ask around … we’re not one of them!  We want you to succeed, and we’ll do everything we can to help you do just that!",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "$120,000 - $145,000/yr plus great benefits"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-sr-database-administrator/6834776003.html",
        "title": "Sr. Database Administrator",
        "date": "2019-03-06 10:24",
        "description": [
            "\n        ",
            "\nJOB DESCRIPTION ",
            "\n  ",
            "\nTitle:                      Sr. Database Administrator on Cyber Security Team                        ",
            "\nLocation:                Washington, DC ",
            "\nEmployee Status:    Regular / Full-time ",
            "\n  ",
            "\n***Must have and be able to maintain a minimum of a Secret Clearance*** ",
            "\n  ",
            "\nPRIMARY FUNCTION ",
            "\nPerform SQL Database Administration and support activities for a Federal Government network. These activities include maintaining a SQL 2014 Data Warehouse as well as supporting the Extract, Transform and Load processes for multiple data sources.   ",
            "\n ",
            "\nESSENTIAL DUTIES & RESPONSIBILITIES ",
            "\n•\tMeets enterprise requirements by planning and developing database structure; developing database utilization policies, procedures, security, backup, and recovery. ",
            "\n•\tMaintains design structure by directing implementation of PL/SQL and SQL standards and guidelines. ",
            "\n•\tCompletes platform upgrades and migrations by issuing instructions; monitoring performance; coordinating actions. ",
            "\n•\tMaintains data integrity by establishing standards; monitoring performance. ",
            "\n•\tMaintains database performance by developing tuning methodologies. ",
            "\n•\tProvides information by collecting, analyzing, and summarizing database performance and trends. ",
            "\n•\tDevelops automated and adhoc reports for Senior Level Executives ",
            "\n•\tDevelops and optimizes daily ETL processes ",
            "\n ",
            "\nSPECIALIZED KNOWLEDGE AND SKILLS: ",
            "\n•\tAt least 5 years experience ",
            "\n•\tExperience with Microsoft SQL 2008, 2012 or 2014 Data Warehouses ",
            "\n•\tMicrosoft SQL Certification desired. ",
            "\n•\tExperience with Microsoft AlwaysOn Availability Groups and Clustering   ",
            "\n•\tKnowledge of Windows host operation system environments ",
            "\n•\tExperience with data replication, backup and recovery ",
            "\n  ",
            "\n  ",
            "\nWORK ENVIRONMENT AND PHYSICAL DEMANDS ",
            "\nCandidate must be able to function in general office environment. ",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive salary commensurate with experience. Excellent Benefits package."
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/fort-belvoir-java-modeling-programmer/6835870204.html",
        "title": "C++ / Java  Modeling Programmer (Clearance Required)",
        "date": "2019-03-07 14:56",
        "description": [
            "\n        ",
            "\nToeroek Associates, Inc. (Toeroek) is looking for a C++ / Java programmer with an interest in developing and supporting modeling tools used in the Countering Weapons of Mass Destruction (CWMD) mission. The position is located at Joint Base Anacostia-Bolling in Washington, DC. ",
            "\n",
            "\nThe modeling work provides on-site technical and analytical support to assure United States Air Force (USAF) Countering Weapons of Mass Destruction policy is feasible and effective. The programmer, working with subject matter experts, develops and/or edits application tools for data sets to analyze, interpret, and enhance our understanding of real-time CWMD activities. This is an excellent opportunity for a programmer to work with other types of subject matter experts as part of a larger team.",
            "\n",
            "\nQualified applicants should include their resume along with a cover letter at ",
            ". Incomplete submissions will not be accepted. Candidates must hold a DoD Secret clearance and be eligible for a Top Secret clearance.",
            "\n",
            "\nDuties:",
            "\n•\tApply C++, Java, and other programming skills to enhance modeling capability and efficiency in support of operations in chemical, biological, radiological or nuclear (CBRN) contaminated environments. ",
            "\n•\tConduct modeling and simulation using VLSTRAC, HPAC and JEM, of agent dispersal and behavior in typical USAF operating environments. Analyze impacts of those models, informed by scientific principles, on air operations at the installation level. (Applicants who do not currently have “agent dispersal” experience or training should still apply.) ",
            "\n•\tLearn and understand probable impacts of CBRN modeling results on USAF critical mission operations; develop science-based risk management decision aids for mitigation of current and projected CBRN hazards. ",
            "\n•\tDevelop understanding of scientific literature related to CBRN. Survey test results, assess validity and relevance for USAF operating environments and recommend incorporation of appropriate data into analytical products.",
            "\n•\tSupport preparation of oral and written reports and briefings, particularly with graphic representations of modeling results, in a form understandable to a non-technical expert, using MS Office suite of products.",
            "\n",
            "\nRequired Qualifications:",
            "\n•\tBachelor's degree in related field preferred. Associates degree and ten (10) years of experience may substitute for Bachelor's degree",
            "\n•\tActive DoD Secret Clearance required with eligibility for TS/SCI",
            "\n•\t1-3 years (or more) in Java, C++, or related programming activities",
            "\n•\tStrong analytic and problem-solving skills",
            "\n•\tProficiency with MS Office products (MS Word, Excel, PowerPoint at a minimum)",
            "\n•\tAbility to prioritize multiple tasks and work independently and as part of a team environment",
            "\n",
            "\nDesired Qualifications:",
            "\n•\tExperience with modeling and simulation using JEM, VLSTRAC, and HPAC",
            "\n•\tPrior USAF service in support of Major Command or Air Staff",
            "\n ",
            "\nToeroek Associates offers a competitive benefits package and salaries.",
            "\n",
            "\nToeroek Associates, Inc. is an Equal Employment Opportunity / Affirmative Action employer.",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive DOE pay, health and dental benefits, 401K and PTO."
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/sterling-entry-level-it-jobs-in-qa-no/6836127107.html",
        "title": "Entry level IT Jobs in QA (No Experience Necessary)",
        "date": "2019-03-07 20:27",
        "description": [
            "\n        ",
            "\nEntry level IT Jobs in QA/BA No Experience Necessary (We will train you Next Training batch starts on March 18th)",
            "\n",
            "\nInterested candidates please send an email with updated copy of your resume ",
            "\n",
            "\nIf you are interested in career change or looking for a better opportunity with high paying $$ jobs in IT industry, we are here to help you.",
            "\n",
            "\nAfter the initial Training Period, We offer comparative salary and job location are VA, DC, MD or it can be any other state.",
            "\n",
            "\nWe are base out of Sterling VA.",
            "\n",
            "\nIf you are ready to make a change please send updated copy of your resume",
            "\n",
            "\nJob Types: Full-time, Contract",
            "\n",
            "\nSalary: $60,000.00 to $90,000.00 /year",
            "\n",
            "\nSavvientqe.com",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "60k to 90k"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/reston-ruby-ruby-on-rails-developer/6836440524.html",
        "title": "Ruby/Ruby on Rails Developer",
        "date": "2019-03-08 11:08",
        "description": [
            "\n        ",
            "\nWiTopia, Inc., a small Northern Virginia Data Privacy and Security company is in search of a talented part-time Ruby/Ruby on Rails developer contractor to help with the development and maintenance of multiple Ruby/Rails applications related to our VPN and encrypted email services.  The applications are APIs, backed on Postgres. We’re looking for a developer with a great deal of independence and self organization with proven experience in building production ready applications. We expect this person to be able to demonstrate an expert understanding in application development as well as work hand in hand with other engineers in developing API endpoints and services that proxy requests to various other applications. Some of these rely on message queues, some are xml, some are json. Work will involve writing code, developing tests, and debugging. As a senior engineer you will be expected to give input on high level architecture decisions, and communicate those decisions to other developers on the team.",
            "\n",
            "\nFor This Role, We Want To See This Track Record of Results:",
            "\n",
            "\n- History developing and supporting actual Ruby/Ruby on Rails applications that have seen production usage with a large user base.",
            "\n- At least 5 years of applicable experience.",
            "\n- Strong Computer Science background and understanding of algorithms and data structures.",
            "\n- Complete understanding of how to write secure code and an awareness of common application security vulnerabilities.",
            "\n- Appreciation for testing and the ability to write specs using RSpec.",
            "\n- Experience working on a remote team.",
            "\n",
            "\nRequired Knowledge, Skills and Abilities Required:",
            "\n",
            "\n- Deep knowledge of Ruby/Ruby on Rails.",
            "\n- An expert understanding of the syntax of Ruby and its nuances, including the ability to work with classes that do not inherit from ActiveRecord.",
            "\n- A solid understanding of object-oriented programming.",
            "\n- A test-centric approach to development, in order to build and deploy with confidence.",
            "\n- Comfortable at the command line, and with advanced git features.",
            "\n- Strong in PostgreSQL.",
            "\n- An understanding of background jobs, including Redis and Sidekiq.",
            "\n- Familiarity with Redmine or similar task tracking application.",
            "\n- Longstanding familiarity with the Ruby and Rails communities -- you stay on top of current news and changes to the language and framework landscape.",
            "\n- A basic understanding of front-end technologies, e.g. JavaScript, HTML5 & CSS3",
            "\n- Ability to adapt quickly and pivot from one project to another.",
            "\n- Desire to solve difficult problems quickly and have an opportunity to see your contributions realized on a Global scale.",
            "\n- Know how the web works under the hood: TCP, HTTP, DNS, IP, caches, etc.",
            "\n- Comfortable communicating on the phone, with Skype, Jabber, and/or Campfire.",
            "\n- The desire to mentor and improve junior and mid level developers.",
            "\n",
            "\nIf interested, email  a copy of your resume, hourly rate, and availability.",
            "\n",
            "\n***This is a work from home, part-time position.***    "
        ],
        "employment_type": "contract",
        "compensation_type": "Competitive"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/merrifield-programmer-software-engineer/6838142448.html",
        "title": "C# Programmer, Software Engineer",
        "date": "2019-03-10 15:15",
        "description": [
            "\n        ",
            "\nContracting Services Solution, is a leading small business professional services provider. ",
            "\nwe have expanded our service offerings to become a provider of workforce augmentation, information",
            "\ntechnology, innovative engineering solutions to the federal government and federal",
            "\ncontractors.",
            "\nHas open position for C# Programmer as Software Engineer ",
            "\nFor development and maintenance programs.",
            "\nEssential Functions:",
            "\nDesigns, modifies, develops, writes and implements software programming applications.",
            "\nFamiliar with SDLC(Software Development Life Cycle), designs, plans, and coordinates work teams.",
            "\nProvides technical support to project team members.",
            "\nA wide degree of creativity and latitude is expected for fast pace R&D environments.",
            "\nTypically reports to a head of a unit/department.",
            "\nEducation and Experience:",
            "\nBachelor’s Degree, preferably in area of specialty",
            "\n7+ years of experience in the field or in a related area",
            "\nAdditional Requirements:",
            "\nFamiliar with Microsoft C# programming language with .Net platform",
            "\nFamiliar with Object-oriented programming (OOP)",
            "\nFamiliar with Microsoft Visual Studio IDE with source control software TFS (Team Foundation Server)",
            "\nExperienced on C#.Net database interface design, SQL and Microsoft Entity Framework",
            "\nExperience on Relational Databases (SQL Server and/or Oracle, SQL Skills)",
            "\nExperienced on C# WinForm with Kiosk software design",
            "\nExperienced on Web Technologies (HTML, XML/XSLT, JavaScript, webservices, JSON, API)",
            "\nExperienced on C# multi-threading programming design",
            "\nExperienced on Windows Presentation Foundation (WPF) is a plus",
            "\nFamiliar with UI interface design technologies is a plus, e.g. speech recognition, text to speech, and so on.",
            "\nFamiliar with section 508 compliant UI design is a plus",
            "\nKnowing of other programming languages is a plus",
            "\nHad hardware driver development experience is a plus",
            "\nTo be able to demonstrate current work is a plus",
            "\nMust be able to pass a pre-employment background check & drug test",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-business-analyst-gdpr/6836666364.html",
        "title": "Business Analyst - GDPR",
        "date": "2019-03-08 14:39",
        "description": [
            "\n        ",
            "\nOVERVIEW",
            "\n",
            "\nOur client combines television channels with media and consumer-oriented assets, including magazines; studios, related digital and social media platforms, books, maps, children and educational media, and ancillary activities that include travel, location-based entertainment, catalog and licensing e-commerce.  A portion of the proceeds from our client’s work will be used to fund science, exploration, conservation and educational initiatives.",
            "\n",
            "\nPOSITION PURPOSE",
            "\n",
            "\nOur client is seeking a Technical Business Analyst for GDPR. The analysis will part of product development that will provide brand new ways for our client to manage consumer engagement. In this role you will partner with the Platform Engineering and Product teams to define new products, collaborate on solutions and approach that will bring it to market. The Platform team develops technology products that consumer and other business products are built upon. This role is critical to understanding how the business strategy will be met by the technology teams.",
            "\n",
            "\nRESPONSIBILITIES",
            "\n",
            "\n•\tLead technical analysis phase of functional and non-functional requirements gathering, understanding business and technology needs into actionable and measurable requirements and Agile stories.",
            "\n•\tTake initiative to partner and collaborate with business, technology and project management stakeholders to ensure requirements will satisfy business and engineering objectives",
            "\n•\tInform, consult, and monitor plans, progress and acceptance aspects of implementation projects as part of ensuring success of business requirement implementations",
            "\n",
            "\nQUALIFICATIONS",
            "\n",
            "\n•\t5+ years experience leading business and technical analysis for web based products",
            "\n•\t3+ years experience with technical and systems analysis",
            "\n•\tExperience with consumer facing websites",
            "\n•\tExperience with, and knowledge of Web technologies, Cloud (AWS), SaaS technologies and custom development to help define functional and non-functional requirements. ",
            "\n•\tFamiliar with the Agile",
            "\n•\tAct as a communication broker – Works with various business and technical stakeholders ensure solutions conform to the requirements. ",
            "\n•\tLead and elicit requirements – a self-starter able to work independently",
            "\n•\tOutstanding written and oral communication skills",
            "\n•\tRun the User Acceptance tests.",
            "\n",
            "\nIf this sounds like you, please respond with your Salary/Hourly rate requirements as soon as possible.",
            "\n",
            "\nPlease no telecommuters or agencies.",
            "\n",
            "\nAbout AAJ Interactive Technologies:",
            "\n",
            "\nAAJ Interactive Technologies, established in 1997 by cutting-edge technology executives, is a technology professional-services company supplying project-based consulting, staff augmentation and recruiting services to leading firms throughout Metropolitan Washington, DC.",
            "\n",
            "\nWe work differently from most of our competition. We have been in both a position of hiring, mentoring and managing large staffs inside a corporate culture, as well as consultants for hire. This unique perspective allows us to understand both sides of this business. We take the time to ensure our consultants/candidates placed will be successful.",
            "\n",
            "\nWe believe that because of our principals we have succeeded where others have failed. The greater DC technology space can be full of companies that are not really looking out for your interests. Ask around, we're not one of them! We want you to succeed, and we'll do everything we can to help you do just that!",
            "\n",
            "\n",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "80-90/hr /1099"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/herndon-it-job-oriented-qa-automation/6838521448.html",
        "title": "IT Job-Oriented QA Automation/BA/ISTQB Training Program",
        "date": "2019-03-11 05:41",
        "description": [
            "\n        ",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n",
            " \n",
            "\n",
            "\n",
            "\n",
            "\n",
            " \n",
            "\n",
            "    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "As per experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/arlington-data-analyst/6838624380.html",
        "title": "Data Analyst",
        "date": "2019-03-11 10:08",
        "description": [
            "\n        ",
            "\nOverview",
            "\n",
            "\nDriven by the pursuit of the next frontier of healthcare, our clients Digital Product Engineering team is changing the way people feel about, think about and interact with health care through ultra-connected, convenient and personal experiences.  A growing organization within a strong growth company, the Digital Product Engineering team leverages and integrates emerging technologies (AI, NLP/U, AR, IoT) into new and existing channels (web, mobile, SMS, bot, voice) to deliver new experiences poised to change the face of consumer health.  ",
            "\n",
            "\nWith a presence in Clarendon neighborhood of Arlington VA, this tight-knit, interdisciplinary team uses a variety of ideation methods—from design thinking to hackathons—to rapidly prototype and develop new capabilities to address the biggest opportunities and core challenges of healthcare consumption. ",
            "\n",
            "\nJob description",
            "\n",
            "\nPosition Purpose: Responsible for analytic data needs of the business unit. Handle complex data projects.",
            "\n",
            "\n",
            "\n•  Provide advanced analytical support for business operations in all or some of the following areas: claims, provider data, member data, clinical data, HEDIS, pharmacy, external reporting",
            "\n",
            "\n•  Extract, load, model, and reconcile large amounts of data across multiple system platforms and sources",
            "\n",
            "\n•  Review data to determine operational impacts and needed actions; elevate issues, trends, areas for improvement and opportunities to management.",
            "\n",
            "\n•  Develop reports and deliverables for management",
            "\n",
            "\n•  Model data using MS Excel, Access, SQL, and/or other data ware house analytical tools",
            "\n",
            "\n•  Ensure compliance with federal and state deliverable reporting requirements by performing data quality audits and analysis.",
            "\n",
            "\nIn this role, you will",
            "\n",
            "\nDesign: ",
            "\n",
            "\n•\tWork with Product to evaluate hypotheses and define success metrics.",
            "\n•\tDesign any necessary experiments – define the control group requirements and data sources needed to evaluate performance.",
            "\n",
            "\nDevelopment:",
            "\n•\tSetup Adobe or Google Analytics to capture usage data with input from Product and UX.",
            "\n•\tSetup necessary queries to access other identified data required to measure performance. This will require integration with systems outside of the Digital Product Engineering team. Data sources will include SQL/NoSQL databases and Google/Adobe Analytics APIs",
            "\n",
            "\nProduction Support:  ",
            "\n•\tMonitor site usage dashboards/set up reports to escalate any potential technical and/or usability issues to Product.",
            "\n",
            "\nReporting",
            "\n•\tUsage Reporting",
            "\n•\tOutcomes Reporting - conduct causal inference on set up experiments or A/B tests to determine objective effectiveness of products or decision",
            "\n",
            "\n",
            "\nQualifications:",
            "\n",
            "\n•\tBachelor’s degree in related field or equivalent experience. ",
            "\n•\t4+ years of statistical analysis or data analysis experience. ",
            "\n•\tHealthcare experience preferred. ",
            "\n•\tAdvanced knowledge of Enterprise Reporting and Analysis tools, SQL. ",
            "\n•\tStrong technical skills using Google Analytics, R or Python strongly preferred. ",
            "\n",
            "\nThis is a full time employee position working directly for our client.  The pay range target is $80,000 - $110,000/yr plus great benefits.",
            "\n",
            "\nThe work is on-site at our clients’ offices in Clarendon/Courthouse area of Arlington.  ",
            "\n",
            "\nIf this sounds like you, please respond with your salary requirements as soon as possible.",
            "\n",
            "\nPlease no telecommuters or agencies.",
            "\n",
            "\n=========================================",
            "\n",
            "\nAbout AAJ Interactive Technologies:",
            "\n",
            "\nAAJ Interactive Technologies, established in 1997 by cutting-edge technology executives, is a technology professional-services company supplying project-based consulting, staff augmentation, and recruiting services to leading firms throughout Metropolitan Washington, DC area.",
            "\n",
            "\nWe work differently from most of our competition.  In our careers, we have been the ones doing the hiring (managing and mentoring large staffs in a corporate culture), and we have been the ones being hired (consulting in small and large roles alike).  This unique perspective allows us to understand both sides of this business.  We take the time to ensure our consultants/candidates will be successful where they are placed.",
            "\n",
            "\nWe believe that because of our principles we have succeeded where others have failed.  The recruiting/technology space can be full of companies that are not really looking out for your interests – ask around … we’re not one of them!  We want you to succeed, and we’ll do everything we can to help you do just that!",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "$80,000 - $110,000/yr plus great benefits"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/seattle-senior-splunk-developer/6838868100.html",
        "title": "Senior Splunk Developer Opportunity in Seattle",
        "date": "2019-03-11 14:01",
        "description": [
            "\n        ",
            "\nAffirma is an award-winning software services consulting company, ranked in Seattle Business “100 Best Companies to Work For” is looking for a Senior Splunk Developer to join a public safety solutions client of ours in Belltown! If you can see the big picture, and get excited about working in DevOPS environment to generate mission critical data analysis/reports then please, read on!",
            "\n",
            "\nThis role is a 6-month contract to permanent position where you would have the opportunity to work with the best and brightest engineers, in an environment that is rewarding and collaborative. You will help us reinvent reporting and monitoring using Splunk capabilities to improve visibility and usability. You will work on architecting and developing solutions for reporting. As a Senior Splunk Developer, you will participate in all tasks required to maintain application availability, responsiveness, and functionality. You will identify and complete work to improve application maintainability, availability, and responsiveness.",
            "\n",
            "\nResponsibilities",
            "\n•\tUnderstand requirements, participating in creating/ proposing solutions",
            "\n•\tDesign and develop Splunk reports, dashboards, applications",
            "\n•\tDevelop proof or concepts and alternate applications of existing solutions for different business scenarios",
            "\n•\tProvide technical support and assistance to users as appropriate",
            "\n•\tTroubleshoot supported applications including web, client-server, and database components",
            "\n•\tCreate and maintain configuration documentation for all assigned systems using Enterprise Architect and Visio.",
            "\n•\tAdhere to our documented software development practices for design, development, testing, and deployment.",
            "\n•\tWork in a pure DevOPS model with end to end visibility ",
            "\n•\tComplete assignments in work request queue in a timely manner.",
            "\n•\tParticipate in on-call support for 24x7 production environments and after hours support as necessary.",
            "\n",
            "\nRequirements",
            "\n•\tMUST be willing to relocate to Seattle",
            "\n•\tHighly proficient in Splunk administration ",
            "\n•\tHighly proficient in SPL and creating reports/dashboards",
            "\n•\tHighly proficient in UNIX/Linux environment and shell scripting",
            "\n•\tProgramming experience required (Java, Python preferred)",
            "\n•\tMinimum 1 year of hands-on SQL development, write SQL, PLSQL, table joins and proficiency with SQL and MySQL or Oracle database servers.",
            "\n•\tMinimum 1 year of hands-on JavaScript/CSS experience.",
            "\n•\tProficiency/Knowledge in big data or schema-less technologies like Hadoop, Spark, MongoDB is a plus",
            "\n•\tExperience performing deployments of Splunk configurations to support data onboarding and other maintenance/upgrade activities",
            "\n•\tStrong written and oral communication skills",
            "\n•\tAbility to work well under pressure",
            "\n•\tProven ability to individually manage work while multitasking",
            "\n•\tHighly energetic with a positive attitude with a keen focus on quality deliverables",
            "\n•\tBachelors Degree from a four-year college or equivalent work experience",
            "\n",
            "\n",
            "\nNice to have",
            "\n•\tTroubleshooting/Supporting web applications experience ",
            "\n•\tWireless, Telecommunication, or Internet industry experiences",
            "\n",
            "\nInterested in this position? Head to ",
            " and submit your application using the job opening ID #817!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/rockville-analyst-programmer/6841237561.html",
        "title": "Analyst/Programmer",
        "date": "2019-03-14 11:39",
        "description": [
            "\n        ",
            "\nLooking for a collaborative, fun company with room for growth?",
            "\n",
            "\nIMS, Inc. is a recognized leader in the biomedical IT field, with clients including the NCI, CDC, & major pharmaceutical firms. We are a diverse group of people with a focus on product quality, customer satisfaction, & enjoying what we do. We have a relaxed, friendly work environment, where employees are recognized for the work that they do. Add to that work/life balance, social events, casual dress, & no cubicles- that’s why many employees have stayed with us.",
            "\n",
            "\nJoin us as an Analyst/Programmer & see what makes IMS such a unique place to work!",
            "\n",
            "\nAs an Analyst/Programmer, you will: ",
            "\n•Write programs to statistically analyze biomedical research data",
            "\n•Prepare data files for analysis & data sharing",
            "\n•Perform error checking & summaries of researcher data files",
            "\n•Complete other programming & analysis related duties as assigned",
            "\n",
            "\nTo be eligible for this position, you must meet the following requirements:",
            "\n•BA/BS in CompSci, Math, or related field from a U.S. DOE accredited institution with a 2.9+ GPA",
            "\n•0-2 years of experience",
            "\n•Proficiency in a programming language (e.g. SAS, C, C++, Java, etc.)",
            "\n•Demonstrated strong verbal & written communication skills",
            "\n•Demonstrated ability to relay technical information to clients & users in layman terms",
            "\n•Demonstrated strong problem solving & analytical skills",
            "\n•Demonstrated ability to communicate with diplomacy & tact as well as maintain professionalism under pressure",
            "\n•Demonstrated ability to handle sensitive data with integrity & security",
            "\n•Excellent attention to detail & organization skills",
            "\n•Must be able to multi-task, meet deadlines, & work within a team",
            "\n•Strong presentation skills preferred",
            "\n",
            "\nIf this sounds like the right position for your career, apply today at: ",
            ".  ",
            "\n",
            "\nIMS is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristic protected by applicable law.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "competitive, commensurate with experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/seattle-senior-splunk-developer/6844265682.html",
        "title": "Senior Splunk Developer Opportunity in Seattle",
        "date": "2019-03-18 11:46",
        "description": [
            "\n        ",
            "\nAffirma is an award-winning software services consulting company, ranked in Seattle Business “100 Best Companies to Work For” is looking for a Senior Splunk Developer to join a public safety solutions client of ours in Belltown! If you can see the big picture, and get excited about working in DevOPS environment to generate mission critical data analysis/reports then please, read on!",
            "\n",
            "\nThis role is a 6-month contract to permanent position where you would have the opportunity to work with the best and brightest engineers, in an environment that is rewarding and collaborative. You will help us reinvent reporting and monitoring using Splunk capabilities to improve visibility and usability. You will work on architecting and developing solutions for reporting. As a Senior Splunk Developer, you will participate in all tasks required to maintain application availability, responsiveness, and functionality. You will identify and complete work to improve application maintainability, availability, and responsiveness.",
            "\n",
            "\nResponsibilities",
            "\n•\tUnderstand requirements, participating in creating/ proposing solutions",
            "\n•\tDesign and develop Splunk reports, dashboards, applications",
            "\n•\tDevelop proof or concepts and alternate applications of existing solutions for different business scenarios",
            "\n•\tProvide technical support and assistance to users as appropriate",
            "\n•\tTroubleshoot supported applications including web, client-server, and database components",
            "\n•\tCreate and maintain configuration documentation for all assigned systems using Enterprise Architect and Visio.",
            "\n•\tAdhere to our documented software development practices for design, development, testing, and deployment.",
            "\n•\tWork in a pure DevOPS model with end to end visibility ",
            "\n•\tComplete assignments in work request queue in a timely manner.",
            "\n•\tParticipate in on-call support for 24x7 production environments and after hours support as necessary.",
            "\n",
            "\nRequirements",
            "\n•\tMUST be willing to relocate to Seattle",
            "\n•\tHighly proficient in Splunk administration ",
            "\n•\tHighly proficient in SPL and creating reports/dashboards",
            "\n•\tHighly proficient in UNIX/Linux environment and shell scripting",
            "\n•\tProgramming experience required (Java, Python preferred)",
            "\n•\tMinimum 1 year of hands-on SQL development, write SQL, PLSQL, table joins and proficiency with SQL and MySQL or Oracle database servers.",
            "\n•\tMinimum 1 year of hands-on JavaScript/CSS experience.",
            "\n•\tProficiency/Knowledge in big data or schema-less technologies like Hadoop, Spark, MongoDB is a plus",
            "\n•\tExperience performing deployments of Splunk configurations to support data onboarding and other maintenance/upgrade activities",
            "\n•\tStrong written and oral communication skills",
            "\n•\tAbility to work well under pressure",
            "\n•\tProven ability to individually manage work while multitasking",
            "\n•\tHighly energetic with a positive attitude with a keen focus on quality deliverables",
            "\n•\tBachelors Degree from a four-year college or equivalent work experience",
            "\n",
            "\n",
            "\nNice to have",
            "\n•\tTroubleshooting/Supporting web applications experience ",
            "\n•\tWireless, Telecommunication, or Internet industry experiences",
            "\n",
            "\nInterested in this position? Head to ",
            " and submit your application using the job opening ID #817!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/ba-qabusiness-analyst-quality-analyst/6838724763.html",
        "title": "BA/QA(BUSINESS ANALYST/QUALITY ANALYST) TRAINING & 100% JOB PLACEMENT",
        "date": "2019-03-11 11:50",
        "description": [
            "\n        ",
            "\nBA/QA(BUSINESS ANALYST/QUALITY ANALYST) TRAINING & 100% JOB PLACEMENT",
            "\n",
            "\n",
            "\nFor more information please call 732 250 3906",
            "\n",
            "\nDemo Introduction Video: www.youtube.com/watch?v=SHj5bH6VTu8",
            "\n",
            "\n",
            "\nWe offer a Combo BA/QA Course where the students can learn the concepts of BA/QA in the same Program with out any additional effort. This also gives the flexibility for the students to choose the best Career option...BA or QA at the end of the course.",
            "\n",
            "\n100% JOB PLACEMENT ASSISTANCE RECORD. ALSO SPECIALIZE IN JOBS PLACEMENTS IN NJ,NY as we work mostly with LOCAL CLIENTS in EAST COAST.",
            "\n",
            "\nWe offer detailed ,comprehensive and Job Oriented training in Business Analyst/Quality Analysis with Placement Assistance.",
            "\nFlexible timings on Weekdays/Weekends",
            "\nProfessional guidance for resume preparation and interviews",
            "\nCounseling/One-on-one discussion with Trainer to clarify your doubts.",
            "\nFlexible timings for the training.",
            "\nAggressive marketing by experienced placement team",
            "\nH1b and Green cards sponsorship for deserving candidates",
            "\nTraining for Certifications and Reimbursement for Certifications on a need basis.",
            "\nProfessional Training and training material.",
            "\nWe are currently looking for Citizens/GC holders/OPT/CPT holders/ H1B",
            "\nWe provide excellent benefits like",
            "\n",
            "\nCompetitive Salary or hourly rates.",
            "\nHealth Insurance.",
            "\nCorporate training opportunities",
            "\nJob Placement",
            "\nResume Preparation",
            "\nDiscussion on Interview Questions",
            "\nJob Placement Support",
            "\nOn Job Support",
            "\n",
            "\n",
            "\nFor more information please call 732 250 3906",
            "\nQA Testing Course Content",
            "\nIntroduction to Software Testing",
            "\n• What is Software Testing?",
            "\n",
            "\nSoftware Development Life cycle",
            "\n• Requirements",
            "\n• Analysis",
            "\n• Design",
            "\n• Coding",
            "\n• Testing",
            "\n• Acceptance",
            "\n",
            "\nSDLC Models",
            "\n• Agile",
            "\n• Waterfall model",
            "\n• Spiral model",
            "\n• V-Model",
            "\n",
            "\nTesting-Methods",
            "\n• White Box Testing",
            "\n• Black Box testing",
            "\n• Gray Box testing",
            "\n",
            "\nTypes of Testing (Black Box Testing)",
            "\n• Build Verification Testing",
            "\n• Functional Testing",
            "\n• Integration Testing",
            "\n• Regression Testing",
            "\n• System Testing",
            "\n• Acceptance Testing",
            "\n• Smoke and Sanity Testing",
            "\n• Ad-hoc Testing",
            "\n• Exploratory Testing",
            "\n• Compatibility Testing",
            "\n• Disaster Recovery Resting",
            "\n• Load, Volume, Stress and Performance Testing",
            "\n",
            "\nTesting Life Cycle / Quality Assurance Life Cycle / Software Testing Life Cycle",
            "\n• Requirements",
            "\n• System study",
            "\n• Test plan",
            "\n• Test Cases",
            "\n• Traceability Matrix",
            "\n• Test case execution",
            "\n• Defect tracking",
            "\n• Test Summary Report",
            "\n• User Acceptance Testing",
            "\n",
            "\nTest Plan",
            "\n• Objective",
            "\n• Scope",
            "\n• Approach",
            "\n• Methodologies",
            "\n• Deliverables",
            "\n• Test environment",
            "\n• Schedule and Resources",
            "\n• Effort and estimation",
            "\n• Entry and Exit criteria",
            "\n• Templates",
            "\n• Risk",
            "\n• Assumption",
            "\n• Contingency Plan",
            "\n• References",
            "\n",
            "\nTest Case",
            "\n• Test Case Design",
            "\n• How to write test cases",
            "\n• When to execute test cases",
            "\n",
            "\nChecklists",
            "\n• How to create checklists",
            "\n• When to use checklists",
            "\n",
            "\nDefect tracking",
            "\n• Defect life cycle",
            "\n• Severity, priority",
            "\n• Defect tracking Tool -- Quality Center, Bugzilla and Rational Clear Quest",
            "\n• Defect report",
            "\n• Defect Tracking Sheet ",
            "\n• OK for recruiters to contact this job poster.",
            "\n• do NOT contact us with unsolicited services or offers",
            "\n",
            "\n",
            "\n•\tOK for recruiters to contact this job poster.",
            "\n•\tdo NOT contact us with unsolicited services or offers",
            "\n",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-software-engineering-fellow/6839887974.html",
        "title": "Software Engineering Fellow",
        "date": "2019-03-12 16:45",
        "description": [
            "\n        ",
            "\nWhat is Pathrise",
            "\n",
            "\nPathrise (YC W18) invests in undervalued university students or young professionals by coaching them to get a competitive internship or job. The program is completely free upfront. In exchange, Pathrise fellows agree to pay back a share of their first year's salary if and only if they get hired.",
            "\n",
            "\nPathrise is based on insights from hundreds of hiring managers in tech; this means everyone from Google recruiters to startup CEOs. We've been featured in TechCrunch, VentureBeat, EdSurge, and The Atlantic as the \"Y Combinator for your career.\" To date, we've worked with over 130 fellows and have helped them land offers at Facebook, Uber, Google, Oath, Amazon, and other top companies or exciting startups.",
            "\n",
            "\nAbout the Fellowship",
            "\n",
            "\nThe Pathrise Fellowship is a program for students and new grads that helps you land the best job or internship possible in tech.",
            "\n",
            "\nDuring the fellowship, you receive 1-on-1 mentorship from experienced industry engineers, analysts, managers, and recruiters. You learn systems to attract the attention of any company you want, find out insider information on how to ace your interviews, and more. We even directly refer you to companies in our network until you find a job you love.",
            "\n",
            "\nOur Mission",
            "\n",
            "\nWe seek to uplift and provide guidance for undervalued students and young professionals in their early career. You can read more about our mission and how it all works on our website: www.pathrise.com.",
            "\n",
            "\nQualifications",
            "\n",
            "\nYou are either in university or within 5 years of graduation, and interested in getting the best possible job.",
            "\nYou want to work with an experienced advisor who can give you expert advice whether you need to learn about data structures or UI/UX patterns.",
            "\nYou are eager to start your career with a job or internship at a top tech company or a rapidly growing startup.",
            "\nYou want a team of advisors who will be by your side throughout the entire process, whenever you need, as long as you need.",
            "\n",
            "\nPlease apply here: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "80,000-160,000"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/stafford-sr-software-developer/6839946791.html",
        "title": "Sr. Software developer",
        "date": "2019-03-12 17:52",
        "description": [
            "\n        ",
            "\nNot a remote position.",
            "\nUS Citizenship Required",
            "\n",
            "\nWe are looking for a Sr. C# Developer for a project in Stafford, VA",
            "\nThe project is scheduled to run for the next 7 years.",
            "\nWe have an awesome team of developers and looking to add two more people. ",
            "\nWe are an Agile shop, using Microsoft technologies (mostly).",
            "\n",
            "\nWe offer flexible hours, partial telecommute and a supportive environment where you can grow as an IT expert.   ",
            "\n",
            "\nIf interested please send resume and salary requirements.",
            "\nBelow are job requirements:",
            "\n",
            "\nUS Citizen and ability to pass a public trust investigation",
            "\n5+ years software development experience using C# and .NET",
            "\nSQL Server 2008 R2 or greater, T-SQL stored procedures, views, etc.",
            "\nFamiliarity with writing unit tests and their role in a Continuous Integration environment",
            "\nExperience with Continuous Integration tools (such as TeamCity (preferred), Jenkins or Hudson)",
            "\nWorking knowledge of WinForms, WPF, WCF, Entity Framework, VB.NET, C++, XML, LINQ, SQL Database platform, MSBuild PowerShell, InstallShield    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Salaried with benefits or hourly"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-independent-software-tester/6839950510.html",
        "title": "Independent Software Tester",
        "date": "2019-03-12 17:57",
        "description": [
            "\n        ",
            "\nDescription: ",
            "\n",
            "\nAs an independent contractor, you will work as a part of a team to build, execute and analyze test cases for web applications.  You’ll be required to execute testing in both an agile and iterative development environment.  You'll work independently and side-by-side with our team to test every function of the web application, compiling results regarding performance, reliability, bugs and other failures.   ",
            "\n",
            "\nRequirements:",
            "\n•\t3+ years of testing work experience ",
            "\n•\tExperience with Protractor, Selenium, Angular JS, and node JS",
            "\n•\tExperience with Java, Javascript/jQuery, and SQL/Oracle is desired.",
            "\n•\tExperience configuring and executing test cases ",
            "\n•\tGood working knowledge of Microsoft Office",
            "\n",
            "\nQualifications: ",
            "\n•\tPosition availability – immediate",
            "\n•\tStrong communications and interpersonal skills",
            "\n•\tCritical thinking, problem-solving, design, and most critically, attention to performance, scalability, reliability, availability at the system and component level",
            "\n",
            "\nInterested applicants should send resume",
            "\n    "
        ],
        "employment_type": "contract",
        "compensation_type": "$50-55 per hour"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-release-manager/6840427361.html",
        "title": "Release Manager/Configuration Specialist",
        "date": "2019-03-13 11:55",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\n",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\nWe're seeking a talented Release Manager/Configuration Specialist. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\n",
            "\nRequirements:",
            "\n",
            "\n",
            "\n• Outstanding release coordination skills ",
            "\n• Experience working on large projects with large application teams",
            "\n• Experience working with Jira and subversion for version control",
            "\n• Excellent communication skills for this client facing role is a must",
            "\n• Technical experience is a plus",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies.",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\n",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/silver-spring-software-engineer-net/6844340477.html",
        "title": "Software Engineer (.NET Developer)",
        "date": "2019-03-18 12:52",
        "description": [
            "\n        ",
            "\nSoftware Engineer (.NET Developer) – Silver Spring, MD",
            "\n",
            "\nPosition Description",
            "\nWill perform system requirements analysis and application design, development, and implementation. Will develop applications based on user requirements including user interface and design, and database development. Develop system prototype and production applications; develop and maintain scripts; troubleshoot and resolve problems; maintain source code versioning; and application IT security tasks. Will develop source code and complete system and user documentation.",
            "\n",
            "\nRequired Skills",
            "\n2+ years of experience designing and/or developing scientific applications. Must have experience with data modeling, software prototyping, and storyboarding. Requires experience with: ASP.NET; C#; AJAX; LINQ; XML; T-SQL; JSON; XML; HTML; CSS; PowerShell and, JavaScript. Experience with Microsoft Team Foundation Server, Google maps and APIs, and SQL server, preferred. Requires good written and verbal communication skills. Familiarity with NWS’s warning and forecast products, observational data, and operational procedures and instructions, GIS a plus.",
            "\n",
            "\nMust be able to pass a background investigation to obtain a security badge to enter the applicable government facility.",
            "\n",
            "\nEducation",
            "\nBS in computer science, related discipline, or equivalent.",
            "\n",
            "\nSubmit resume to ERT's Career Opportunities Web Page at: ",
            "\n",
            "\nEarth Resources Technology, Inc. (ERT)",
            "\nERT is a VEVRAA Federal Contractor and Equal Opportunity/Affirmative Action employer - All qualified applicants will be considered for employment without regard to race, color, religion, sex, national origin, disability, or protected Veteran status.",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-full-stack-java-developer/6845001744.html",
        "title": "Full Stack Java Developer",
        "date": "2019-03-19 09:29",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking talented and motivated Full stack Java developers with a strong background in software design and development having worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\nRequirements:",
            "\n- Experience with Java and XML",
            "\n- Excellent knowledge of Relational Databases, SQL and ORM technologies",
            "\n- Spring and Hibernate experience is preferred",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!",
            "\n",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/manassas-senior-java-ruby-developer/6845021678.html",
        "title": "Senior Java/Ruby Developer",
        "date": "2019-03-19 09:53",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking a talented Senior Java/Ruby developer with a strong background in software design and development having worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\n",
            "\nRequirements:",
            "\n- 11+ years of experience",
            "\n- Excellent knowledge of JVM languages, specifically Java and some Ruby ",
            "\n- Strong Linux background is preferred",
            "\n- Elastic Search or Solr background would be ideal",
            "\n- Top Secret Clearance is required",
            "\n- Ability to work effectively in a cross-functional team environment",
            "\n- Strong communication skills are a must",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/mc-lean-curriculum-lead-for-14-wk/6850523512.html",
        "title": "Curriculum Lead for 14 Wk Coding School to Train New Devs",
        "date": "2019-03-25 22:37",
        "description": [
            "\n        ",
            "\n",
            "\n",
            " is a fast-growing startup that provides a fast-track to becoming a software developer in today's growing tech market. We take people with little to no experience in development and train them to be professional developers in only a matter of weeks, which in turn opens a whole new set of career and economic opportunities for them. We have 9 campuses across the US, and counting…",
            "\n",
            "\nVisit our website to learn more about the program and the curriculum you'll be working on",
            "\n",
            "\n",
            "\n",
            "\n",
            "\nCoding Dojo is looking for a driven and creative go-getter to lead all things Instruction and Curriculum. This integral member of our team will innovate on our academic vision and instructional strategies across a nationwide community of Coding Dojo campuses. This person has a strategic mind, an unfailing entrepreneurial spirit, and the drive to continuously improve and evolve our curriculum and related product offerings. This role calls for an enthusiastic individual who is customer-centric, passionate, and proactive. Must be a dynamic leader with a solid track-record of people management and the ability to lead a large team spreading across several different locations. The Director of Instruction and Curriculum Design is a hands-on collaborator that will work primarily with the Executive Leadership Team and various members of the Instruction Department to author and revise captivating and effective curriculum and structure design for our students, partners, and returning alumni. ",
            "\n",
            "\nVisit our careers page to learn more about the requirements of this role and to apply ",
            "\n",
            "\n",
            "\n",
            "\n",
            "\n• Minimum 5+ years of teaching experience, preferably in an Education Technology environment. ",
            "\n• Minimum 5+ years building curriculum, preferably in Computer Programming and related breadth areas. ",
            "\n• Proven track record of project management, particularly curriculum related projects. ",
            "\n• Proven ability to effectively communicate recommendations to leadership as related to curriculum and program design. ",
            "\n• Solid technical background with understanding and/or hands-on experience in software development and web technologies.",
            "\n• Skilled at working effectively with cross functional teams. Excellent written and verbal communication skills.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-angular-developer/6845002661.html",
        "title": "Angular Developer",
        "date": "2019-03-19 09:30",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking a talented Java/Angular Engineer with a strong background in software design and development having worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n",
            "\n",
            "\nRequirements:",
            "\n- 5+ years of experience with Java, Angular, Hibernate",
            "\n- Excellent knowledge of Relational Databases, SQL and ORM technologies",
            "\n- Ability to work effectively in a cross-functional team environment",
            "\n- Experiencing working on Financial systems with precise business logic",
            "\n- Strong interpersonal skills",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/herndon-innovative-technology-consultant/6845000997.html",
        "title": "Innovative Technology Consultant",
        "date": "2019-03-19 09:28",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! We work with different technologies including Java, Microsoft stack (ASP.NET, C#), Python/Django, Ruby on Rails, JavaScript along with JavaScript frameworks (Angular, Node, React). At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n",
            "\nWe're seeking talented Software Engineers with a strong background in software design and development. We have multiple exciting full-time opportunities to work in a fast-paced team environment.",
            "\n",
            "\n",
            "\nRequirements:",
            "\n- Strong in at least one or more software languages",
            "\n- Ability to work effectively both independently and in a cross-functional team environment",
            "\n- Excellent communication skills ",
            "\n- Experience with relational databases is preferred",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/alexandria-project-manager/6850806610.html",
        "title": "Project Manager",
        "date": "2019-03-26 11:49",
        "description": [
            "\n        ",
            "\nIronistic is an awesome blend of a traditional web development shop as well as a digital marketing agency, and we're looking for the right person to join our team as a Website Development Project Manager. The Project Manager is responsible for leading our design and development team in building fantastic websites and apps. Communication and organization are absolutely essential for this position.",
            "\n",
            "\nThe ideal project manager will include the following:",
            "\n•1-3 years of experience in website project management",
            "\n•Comprehensive knowledge of web development practices and standards",
            "\n•Ability to plan, monitor, and communicate all aspects of a web development project",
            "\n•Ability to communicate effectively with Ironistic staff and Ironistic clients across all phases of the development lifecycle",
            "\n•Experience leading the build for both small theme-based sites as well as large custom websites",
            "\n•Must be able to manage multiple projects at once and be able to problem solve during high volume times",
            "\n•Understanding of SEO best practices",
            "\n•Multiple CMS experiences a plus",
            "\n",
            "\nProject Manager duties include:",
            "\n•Interacting closely with designers, developers, marketers, and all development team members",
            "\n•Work directly with Ironistic clients to successfully build out their projects",
            "\n•Ensure projects successfully remain on time and budget",
            "\n•Lead project planning and estimating",
            "\n•Communicate and manage all project requirements and timelines both internally and externally",
            "\n",
            "\nOther requirements for Project Manager include:",
            "\n•Bachelor's degree in a related field (or relevant work experience)",
            "\n•Strong communication skills and customer service skills",
            "\n•Ability to be able to perform with little direction or supervision",
            "\n•Ability to work well within a team environment",
            "\n",
            "\nBenefits:",
            "\n*Health & Life Insurance – Premiums for employee paid by Ironistic",
            "\n*Dental & Vision Insurance",
            "\n*401(k) with generous company match",
            "\n*Generous paid time off",
            "\n*Continuing education fund – always keep learning!",
            "\n*“Free” day once per month – Explore the latest trends in the digital world!",
            "\n*SmartTrip Metro Benefits (if in DC area)",
            "\n*Various monthly rewards for doing great work and being a team player",
            "\n*Awesome office amenities: Shuffleboard tables, treadmill desk, arcade game, open/collaborative spaces, and snacks/drinks!",
            "\n",
            "\nAbout Us:",
            "\nIronistic provides full website strategy, design, development, and marketing. We focus on building long-term strategies in order to ensure the ongoing evolution of our client websites. Co-founded by industry experts with more than 40 combined years of experience in the web development world, Ironistic works with small and medium-sized companies, associations and nonprofits, government agencies, Fortune 500 companies, and more. Ironistic is platform agnostic and builds websites, apps, Intranets, and social media tools with the technologies that best fit the needs of our clients. We’re also pretty awesome to hang out with!",
            "\n",
            "\nApply online at ",
            "\n ",
            "\nIronistic is an Affirmative Action/Equal Opportunity Employer",
            "\nF/M/Vet    "
        ],
        "employment_type": "full-time",
        "compensation_type": "TBD based on experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/beltsville-application-testing-associate/6850726158.html",
        "title": "Application Testing Associate",
        "date": "2019-03-26 10:27",
        "description": [
            "\n        ",
            "\nLooking to launch your new career? ",
            "\n                                        Searching for a position with plenty of room for growth?",
            "\n",
            "\nIMS, Inc. is a recognized leader in the biomedical IT field, with clients including the NCI, CDC, and major pharmaceutical firms. We are a diverse group of people with a focus on product quality, customer satisfaction, and enjoying what we do. We have a relaxed, welcoming work environment, where we respect employees’ personal & family time by providing flexibility and work-life balance. We design our positions to emphasize the personal strengths of each employee and encourage their professional growth. Add to that social events, casual dress, and no cubicles- that’s why many employees have stayed with us!",
            "\n",
            "\nJoin us as an Application Testing Associate & see what makes IMS such a rewarding place to work!",
            "\n",
            "\nAs an Application Testing Associate on our Quality Assurance team, you will: ",
            "\n•Support the Client Experience team with testing multiple software systems to ensure full functionality & resolution of client concerns",
            "\n•Conduct formal & informal testing (e.g. functional requirements, user acceptance, 508 compliance, performance, load, etc.) of software products to validate the integrity, functionality, & performance of the products prior to and after software releases, updates, & bug fixes",
            "\n•Document and track results of testing activities",
            "\n•Collaborate with the Client Experience and Development teams to ensure resolution of all identified issues",
            "\n•Perform other QA-related duties as assigned",
            "\n",
            "\nTo be eligible for this position, you must meet the following requirements:",
            "\n•BA/BS in IS, IT, Math, Bio, or a related field from a U.S. DOE accredited institution w/3.0+ GPA",
            "\n•6 months-4 years of related professional QA/QC experience",
            "\n•Demonstrated knowledge of software testing methods and best practices",
            "\n•Demonstrated understanding of the SDLC ",
            "\n•Demonstrated strong verbal & written communication skills",
            "\n•Demonstrated ability to relay technical information to team members in layman terms",
            "\n•Demonstrated strong problem-solving & analytical skills",
            "\n•Excellent attention to detail & organization skills",
            "\n•Must be able to multi-task, meet deadlines, & work within a team",
            "\n•Understanding of database structures preferred",
            "\n",
            "\nIf this sounds like the right career for you, apply today at:  ",
            ".  ",
            "\n",
            "\nIMS is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristic protected by applicable law.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "comptetitive, commensurate with experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/herndon-python-django-developer/6845002175.html",
        "title": "✳️ Python/Django Developer",
        "date": "2019-03-19 09:29",
        "description": [
            "\n        ",
            "\nAbout US:",
            "\nWe've been in business since 2002 and our team is constantly growing. 98% of our company is comprised of Engineers focused on Software Construction including Developers, Engineers in test, Project Managers, Scrum Masters, Analysts including our Managing Partners, Arthur and Joel. We offer consulting services throughout the Northern Virginia/Washington, DC area and our home office is located in Herndon, Virginia.",
            "\n",
            "\n",
            "\nIf full stack development and working with various languages and technologies excite you, then there's a spot for you on our team! At Solution Street, our employees have many opportunities to work on interesting, challenging projects supporting clients one-on-one in various domains primarily in the commercial space. Our company culture thrives on our five core values: Honesty, Respect, Transparency, Dependability, and FUN! They're embedded in everything we do and how we do it!",
            "\n",
            "\n ",
            "\nWe're seeking a talented and motivated Python/Django developer with a strong background in software design and development having worked on multiple projects over their career. This is an exciting full-time opportunity to work in a fast-paced team environment.",
            "\n  ",
            "\n",
            "\nResponsibilities",
            "\n",
            "\n-Design, implement and maintain application phases.",
            "\n-Contribute in all phases of the development life cycle.",
            "\n-Write well designed, testable, efficient code.",
            "\n-Ensure designs are in compliance with specifications.",
            "\n-Recommend changes to improve established application processes.",
            "\n-Prepare and produce releases of software components.",
            "\n-Develop application code programs.",
            "\n-Develop and execute unit test plans.",
            "\n-Support formal testing and resolve test defects.",
            "\n-Provide technical support and consultation for application and infrastructure questions.",
            "\n",
            "\nQualifications",
            "\n",
            "\n-Full Stack Engineer with related working experience in the IT field, consulting experience is a plus",
            "\n-Strong in Python",
            "\n-Exposure to Django framework is ideal",
            "\n-Experience with Angular or other modern Javascript Framework",
            "\n-Excellent knowledge of Relational Databases, SQL and ORM technologies such as Hibernate",
            "\n-Ability to handle multiple projects and assignments simultaneously and effectively in a cross-functional team environment",
            "\n-Strong interpersonal skills",
            "\n",
            "\n",
            "\nGreat Engineers + Great Communication = Successful Projects. We enjoy working with cutting edge technologies and providing solutions to complex business problems. Solution Street, based in Northern Virginia's high-tech corridor, is an information technology consultancy that helps Fortune 500 companies, startups and non-profit organizations achieve their business goals through the design and rapid deployment of web applications. Solution Street is run by software engineers and our employees are experts in building large, highly scalable and well performing web applications using Java EE, .NET, JavaScript and Ruby on Rails technologies. ",
            "\n",
            "\n",
            "\nWhat's In It for You?",
            "\nWe offer a relaxed, fun, flexible, working environment with competitive salary + bonus + 100% paid health/dental to employee + life insurance + PTO + long-term disability + 401(k). Solution Street automatically contributes to employees' 401(k) plans. We are passionate about technology and we share out thoughts and discoveries in our monthly newsletters. To subscribe to our latest blog, please visit: ",
            ". Solution Street is also a sponsor of NOVA SART (Northern Virginia Software Architecture Round Table Group). Please visit www.solutionstreet.com or check out our Face page ",
            " for more information regarding our company culture, the charities we support, and the fun events we do together!",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "commensurate to experience."
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/big-data-hadoop-data-analyst-scientist/6844929687.html",
        "title": "Big Data Hadoop Data Analyst/Scientist, Dev, Admn, AWS Devl/SysOps/Arc",
        "date": "2019-03-19 06:16",
        "description": [
            "\n        ",
            "\nAWS Cloud SysOps/Architect/Developer/Security/Network/Big Data, Hadoop Administrator/Developer/Data Analyst, Machine Learning, Artificial Intelligence, Developing Blockchain applications, Cyber Security, Programming in Java, Python, Node.js, Ruby, PHP, Perl, Go, Spark, Scala, R and more...",
            "\n",
            "\nHere is AN EXCELLENT OPPORTUNITY in your way for a ROCK SOLID professional career and to achieve your dream job of a 6 digit salary!!",
            "\n",
            "\nYou Learn, We Help you Gain a HIGHLY paid JOB and a great CAREER!!",
            "\n========================================================",
            "\nHere is the most promising and rewarding career opportunity for you, even if you are altogether NEW to Software industry looking for a very bright career or you may have already been WORKING in the Software/IT field. ",
            "\nWe continue to stay focused on the HOTTEST and Revolutionary Technologies as driven by the growing IT market demand and the requirements of our Clients.",
            "\n",
            "\nCurrent Month SPECIALS",
            "\n===================",
            "\nBig Data Hadoop Data Analyst, Data Scientist, Developer (Pig, Hive, Sqoop, Flume, Spark, R, Kafka, Storm, etc.)",
            "\nBig Data Hadoop Administrator",
            "\nBig Data Hadoop on Cloud",
            "\nAWS Big Data Analyst/Developer/Administrator (AWS Elastic Mapreduce, Kinesis, Dynamo DB, Redshift, etc.)",
            "\nAWS Sys Ops Administrator",
            "\nAWS Dev Ops Engineer",
            "\nAWS System Architect",
            "\nAWS Developer",
            "\n",
            "\n",
            "\nHow are we DIFFERENT from others",
            "\n===========================",
            "\nFree training option",
            "\n24x7 on-job support",
            "\nStrong client base and marketing network for job placement",
            "\nTraining package customized just for you to help ensure your success",
            "\nIn class training sessions in the weekends",
            "\nCertified instructors with over 2 decades of real-time enterprise IT experience",
            "\nSpecial package for fresh Graduates or College Seniors or Associate Degree holders",
            "\n",
            "\nFree DEMO",
            "\n==================================",
            "\nCall us today @ 703-844-3764 for a free DEMO this weekend and to get all your questions answered.",
            "\n",
            "\nCurrently available Training Programs",
            "\n==================================",
            "\nBig Data, Hadoop, MongoDB, NOSQL",
            "\nIntroduction to Big Data",
            "\nHadoop Development",
            "\nBig Data Analytics",
            "\nHadoop Administration",
            "\n",
            "\nAmazon Web Services",
            "\nAWS SysOps, Architect and Developer",
            "\n",
            "\nORACLE DATABASE",
            "\nOracle DBA 12c",
            "\nSQL Programming",
            "\nPL/SQL",
            "\nSQL Tuning",
            "\nOracle 12c RAC",
            "\nData Warehousing",
            "\nDesign",
            "\nDevelopment",
            "\n",
            "\nPEOPLESOFT",
            "\nPeopleSoft Administration",
            "\nPeopleSoft DBA",
            "\nPeopleSoft Developer",
            "\n",
            "\nMOBILE APP DEVELOPMENT",
            "\niPhone & iPad Programming",
            "\nAndroid Application Development",
            "\nObjective-C Programming",
            "\nMobile App & Device Security",
            "\n",
            "\nWEB DEVELOPMENT & XML",
            "\nHTML 5",
            "\njQuery",
            "\nWebsites for Mobile Devices",
            "\nJavaScript",
            "\nExtensible Markup Language (XML)",
            "\nCreating Websites",
            "\nCSS3",
            "\n",
            "\nJAVA, PERL, PYTHON, PHP and SCALA",
            "\nSpring & Hibernate",
            "\nJava EE",
            "\nBest Practices",
            "\nDesign Patterns",
            "\nJava Web Applications",
            "\nWeb Services",
            "\nPerl & Python Scripting",
            "\n",
            "\nUNIX and LINUX",
            "\nUNIX Basics",
            "\nShell Scripting",
            "\nLinux Administration",
            "\n",
            "\nWEBLOGIC",
            "\nWebLogic Administration",
            "\n",
            "\nPROJECT MANAGEMENT",
            "\nProject Management Professional (PMP)",
            "\nPMI - Agile Certified Practitioner (PMI-ACP) ",
            "\n",
            "\nWe offer both CLASSROOM and ONLINE classes. ",
            "\n",
            "\nWe assure you 100% satisfaction with our training programs and help you with successful job placement and more importantly provide ON-JOB TECHNICAL SUPPORT. ",
            "\n",
            "\nAt INFOSOFTWORLD INC., your success is our passion! Let's get started for a creative, long lasting and highly fruitful professional RELATION now!!",
            "\n    "
        ],
        "employment_type": "full-time",
        "compensation_type": "$$$$$"
    },
    {
        "url": "https://washingtondc.craigslist.org/mld/sof/d/beltsville-junior-web-developer-php/6850876125.html",
        "title": "Junior Web Developer (PHP)",
        "date": "2019-03-26 12:54",
        "description": [
            "\n        ",
            "\nLooking for a collaborative, fun company with room for growth?",
            "\n",
            "\nIMS, Inc. is a recognized leader in the biomedical IT field, with clients including the NCI, CDC, & major pharmaceutical firms. We are a diverse group of people with a focus on product quality, customer satisfaction, & enjoying what we do. We have a relaxed, friendly work environment, where employees are recognized for the work that they do. Add to that work/life balance, social events, casual dress, & no cubicles- that’s why many employees have stayed with us.",
            "\n",
            "\n                   Join us as a Junior Web Developer (PHP) & see what makes IMS such a unique place to work!",
            "\n",
            "\nAs a Junior Web Developer (PHP), you will: ",
            "\n•Design & develop web-based applications for new products & enhancements to existing products using PHP for small web applications & forms & Drupal CMS for complex websites",
            "\n•Gather requirements",
            "\n•Develop prototypes & code applications, maintaining the quality of existing applications",
            "\n•Test & debug code",
            "\n•Prepare documentation following company standards & applicable regulations",
            "\n•Perform other web development related duties as assigned",
            "\n",
            "\nTo be eligible for this position, you must meet the following requirements:",
            "\n•BA/BS from a U.S. DOE accredited institution with a 2.9+ GPA",
            "\n•0-5 years of related programming experience",
            "\n•Proficiency in PHP required",
            "\n•Working knowledge of CMSs (e.g. Drupal, WordPress, etc.)",
            "\n•Demonstrated front-end development skills (e.g. HTML, CSS, jQuery)",
            "\n•Demonstrated strong verbal & written communication skills",
            "\n•Demonstrated ability to relay technical information to clients & users in layman terms",
            "\n•Demonstrated strong problem-solving & analytical skills",
            "\n•Demonstrated customer service skills",
            "\n•Excellent attention to detail & organization skills",
            "\n•Must be able to multi-task, meet deadlines, and work within a team",
            "\n",
            "\nIf this sounds like the right position for your career, apply today at: ",
            ".  EOE/M/F/Disability/Vet",
            "\n",
            "\nIMS is an Equal Opportunity Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, national or ethnic origin, age, disability, protected veteran status, or other characteristic protected by applicable law.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "competitive, commensurate with experience"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/seattle-senior-splunk-developer/6850865469.html",
        "title": "Senior Splunk Developer Opportunity in Seattle",
        "date": "2019-03-26 12:44",
        "description": [
            "\n        ",
            "\nAffirma is an award-winning software services consulting company, ranked in Seattle Business “100 Best Companies to Work For” is looking for a Senior Splunk Developer to join a public safety solutions client of ours in Belltown! If you can see the big picture, and get excited about working in DevOPS environment to generate mission critical data analysis/reports then please, read on!",
            "\n",
            "\nThis role is a 6-month contract to permanent position where you would have the opportunity to work with the best and brightest engineers, in an environment that is rewarding and collaborative. You will help us reinvent reporting and monitoring using Splunk capabilities to improve visibility and usability. You will work on architecting and developing solutions for reporting. As a Senior Splunk Developer, you will participate in all tasks required to maintain application availability, responsiveness, and functionality. You will identify and complete work to improve application maintainability, availability, and responsiveness.",
            "\n",
            "\nResponsibilities",
            "\n•\tUnderstand requirements, participating in creating/ proposing solutions",
            "\n•\tDesign and develop Splunk reports, dashboards, applications",
            "\n•\tDevelop proof or concepts and alternate applications of existing solutions for different business scenarios",
            "\n•\tProvide technical support and assistance to users as appropriate",
            "\n•\tTroubleshoot supported applications including web, client-server, and database components",
            "\n•\tCreate and maintain configuration documentation for all assigned systems using Enterprise Architect and Visio.",
            "\n•\tAdhere to our documented software development practices for design, development, testing, and deployment.",
            "\n•\tWork in a pure DevOPS model with end to end visibility ",
            "\n•\tComplete assignments in work request queue in a timely manner.",
            "\n•\tParticipate in on-call support for 24x7 production environments and after hours support as necessary.",
            "\n",
            "\nRequirements",
            "\n•\tMUST be willing to relocate to Seattle",
            "\n•\tHighly proficient in Splunk administration ",
            "\n•\tHighly proficient in SPL and creating reports/dashboards",
            "\n•\tHighly proficient in UNIX/Linux environment and shell scripting",
            "\n•\tProgramming experience required (Java, Python preferred)",
            "\n•\tMinimum 1 year of hands-on SQL development, write SQL, PLSQL, table joins and proficiency with SQL and MySQL or Oracle database servers.",
            "\n•\tMinimum 1 year of hands-on JavaScript/CSS experience.",
            "\n•\tProficiency/Knowledge in big data or schema-less technologies like Hadoop, Spark, MongoDB is a plus",
            "\n•\tExperience performing deployments of Splunk configurations to support data onboarding and other maintenance/upgrade activities",
            "\n•\tStrong written and oral communication skills",
            "\n•\tAbility to work well under pressure",
            "\n•\tProven ability to individually manage work while multitasking",
            "\n•\tHighly energetic with a positive attitude with a keen focus on quality deliverables",
            "\n•\tBachelors Degree from a four-year college or equivalent work experience",
            "\n",
            "\n",
            "\nNice to have",
            "\n•\tTroubleshooting/Supporting web applications experience ",
            "\n•\tWireless, Telecommunication, or Internet industry experiences",
            "\n",
            "\nInterested in this position? Head to ",
            " and submit your application using the job opening ID #817!    "
        ],
        "employment_type": "full-time",
        "compensation_type": "DOE"
    },
    {
        "url": "https://washingtondc.craigslist.org/doc/sof/d/washington-software-engineering-fellow/6851207376.html",
        "title": "Software Engineering Fellow",
        "date": "2019-03-26 18:41",
        "description": [
            "\n        ",
            "\nWhat is Pathrise",
            "\n",
            "\nPathrise (YC W18) invests in undervalued university students or young professionals by coaching them to get a competitive internship or job. The program is completely free upfront. In exchange, Pathrise fellows agree to pay back a share of their first year's salary if and only if they get hired.",
            "\n",
            "\nPathrise is based on insights from hundreds of hiring managers in tech; this means everyone from Google recruiters to startup CEOs. We've been featured in TechCrunch, VentureBeat, EdSurge, and The Atlantic as the \"Y Combinator for your career.\" To date, we've worked with over 130 fellows and have helped them land offers at Facebook, Uber, Google, Oath, Amazon, and other top companies or exciting startups.",
            "\n",
            "\nAbout the Fellowship",
            "\n",
            "\nThe Pathrise Fellowship is a program for students and new grads that helps you land the best job or internship possible in tech.",
            "\n",
            "\nDuring the fellowship, you receive 1-on-1 mentorship from experienced industry engineers, analysts, managers, and recruiters. You learn systems to attract the attention of any company you want, find out insider information on how to ace your interviews, and more. We even directly refer you to companies in our network until you find a job you love.",
            "\n",
            "\nOur Mission",
            "\n",
            "\nWe seek to uplift and provide guidance for undervalued students and young professionals in their early career. You can read more about our mission and how it all works on our website: www.pathrise.com.",
            "\n",
            "\nQualifications",
            "\n",
            "\nYou are either in university or within 5 years of graduation, and interested in getting the best possible job.",
            "\nYou want to work with an experienced advisor who can give you expert advice whether you need to learn about data structures or UI/UX patterns.",
            "\nYou are eager to start your career with a job or internship at a top tech company or a rapidly growing startup.",
            "\nYou want a team of advisors who will be by your side throughout the entire process, whenever you need, as long as you need.",
            "\n",
            "\nPlease apply here: ",
            "    "
        ],
        "employment_type": "full-time",
        "compensation_type": "80,000-160,000"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/falls-church-mobile-app-developer/6851562050.html",
        "title": "mobile app developer",
        "date": "2019-03-27 10:36",
        "description": [
            "\n        ",
            "\nWe are looking for a mobile app developer , with experience in both Android and IOS. This gig is for developers who believe in the product and willing to work for equity. The app is already completed but requires redesign , continuous support and changes. we are going after seed money soon but to bring the right person onboard. ",
            "\n",
            "\nPlease only serious candidates with proven experience. ",
            "\n",
            "\nBest, ",
            "\nJ    "
        ],
        "employment_type": "contract",
        "compensation_type": "TBD"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/bealeton-visual-basic-and-or-tutor/6851734615.html",
        "title": "Visual Basic and/or C# tutor wanted",
        "date": "2019-03-27 13:26",
        "description": [
            "\n        ",
            "\nI am looking for a tutor for Visual Basic and/or C#.  I am not a beginner, but a looking for someone to help me with certain types of statements (such as embedded Do Until, etc.)  I am willing to travel to a location that best meets your needs, using my work laptop software to train with.    "
        ],
        "employment_type": "employee's choice",
        "compensation_type": "Hourly fee to be determined"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/washington-senior-business-analyst/6851576277.html",
        "title": "Senior Business Analyst",
        "date": "2019-03-27 10:52",
        "description": [
            "\n        ",
            "\nPOSITION OVERVIEW",
            "\nSenior Business Analyst",
            "\n6+ Years of Business Analyst Experience with Software Development Projects",
            "\nFull-time - Onsite at Federal Client Site in Washington DC ",
            "\nTO APPLY, CLICK HERE: ",
            "\n",
            "\nABOUT ARTEMIS CONSULTING",
            "\nArtemis Consulting is a D.C. area-based IT Services and Management Consulting firm that is on the Inc. 5000 list of the fastest growing companies in the U.S. Our teams are collaborative, self-motivated, and focused on creating value for our clients. We are a flourishing company where you have an opportunity to learn and grow with your peers. We believe in getting the job done and having work-life balance. We offer competitive salaries with a comprehensive benefits package including employer-subsidized health, dental & vision insurance, 401(k) matching, 10 paid Federal holidays, paid vacation, and sick leave.",
            "\n ",
            "\nJOB SCOPE AND RESPONSIBILITIES",
            "\nServe as a Lead Business Analyst on a team at a Federal Government with an information-sharing mission in support of building applications using the Agile development methodology. Be part of a dynamic team that works closely with the client on a day-to-day basis. The ability to be flexible is important as client requirements can shift. Be eager to learn client business in depth and act as a subject matter expert (SME) for the development team. The client atmosphere is congenial and welcomes ideas that can improve productivity. The ideal candidate for this position enjoys leading/driving business system requirements, facilitating grooming sessions and taking ownership of the system functionality.",
            "\n ",
            "\nUnder minimal direction, perform as a Senior Business Analyst as part of a large agile development team involved in development of a mission critical cloud (AWS) based application. Take ownership for business needs discovery and documentation with a proactive mindset.",
            "\n",
            "\nResponsibilities of this role include but are not limited to:",
            "\nCapture detailed business requirements, User Stories and Acceptance Criteria in JIRA",
            "\nWork with Product Owner/System Owner, Development, UX/UI, QA team and Subject Matter Experts to ensure alignment and proper interpretation of complex functional requirements.",
            "\nFacilitate product requirements sessions with large group of stakeholders including SME’s, PO, PM, Architect and group Leads, and drive the group to gather and finalize requirements while ensuring that the product backlog and supporting requirements artifacts are on track to meet the project deliverables.",
            "\nEnsure end to end requirements traceability, mapping user stories to software test cases, applicable business processes, wireframes and UX comps.",
            "\nLeverage strong written and verbal communication skills to drive requirements sessions in a large setting including Product Owners, Subject Matter Experts, Project Manager, Architect, Team Leads and client personnel.",
            "\nCollaborate with team members, sharing knowledge, and continuously improving business analysis efforts, identify and close gaps.",
            "\nDocument functional specifications, traceability matrices, process flow diagrams, wireframes, meeting agenda, meeting minutes, and other supporting artifacts.",
            "\nActively participate in Scrum ceremonies including Sprint Planning, Grooming, Review and Retrospective sessions, and give application demo to the Product Owners/Subject Matter Experts.",
            "\n",
            "\nSKILLS AND QUALIFICATIONS",
            "\nMust be flexible, able to work in a highly collaborative environment, juggle multiple tasks at once, and work independently and collaboratively as needed. Must have superior interpersonal skills and strong communication skills. Be comfortable working directly with the Project Manager and Scrum Master to support emerging client needs.",
            "\n6+ years of experience in documenting business and functional requirements",
            "\n3+ years working in an Agile environment, with demonstrated ability to clearly articulate User Stories and Conditions of Satisfaction to development teams",
            "\nWeb based software development experience involving complex workflows.",
            "\nExperience working with large size teams consisting of multiple Scrum teams",
            "\nDemonstrated ability to elicit, create, and analyze functional and non-functional requirements",
            "\nExperience organizing and maintaining Product and Sprint backlogs",
            "\nExperience presenting detail summaries of progress and updates",
            "\nAbility to facilitate and drive group discussions to build a shared understanding of software requirements",
            "\nAbility to foster solid working relationships with senior level management and subject matter experts within the team and client organization",
            "\nExperience working within teams that include remote team members",
            "\nPropensity to mentor staff on functional expertise and provide peer reviews of deliverables for other product lines",
            "\nConfident in requirement knowledge to help lead change and implement new strategies company wide",
            "\nAbility to work independently and in an awesome team setting",
            "\nExperience with Jira, Confluence and Balsamiq tools",
            "\nExcellent written and verbal communication skills",
            "\nAbility to pass basic government background check",
            "\n ",
            "\nPREFERRED EXPERIENCE",
            "\n2+ years federal contracting experience",
            "\nExperience managing efforts of more junior Business Analysts",
            "\nAbility developing and delivering presentations to client stakeholders and delivering training",
            "\n ",
            "\nEDUCATION",
            "\nUndergraduate Degree highly desired but can be substituted with 4 additional years of experience",
            "\n ",
            "\nOTHER REQUIREMENTS",
            "\nWork location is Washington D.C. with occasional meetings in metro-area",
            "\nUS Citizen or individual with authorization to work in the U.S. (No C2C; sponsorship of individuals is not feasible)",
            "\nBackground and credit check are necessary",
            "\n ",
            "\nArtemis Consulting is an equal-opportunity employer, committed to diversity and inclusion. All qualified candidates will receive equal consideration for employment without regard to disability, race, color, religious creed, national origin, sexual orientation/gender identity, or age.",
            "\n",
            "\nPrincipals only. Recruiters, please don't contact this job poster",
            "\nDo NOT contact us with unsolicited services or offers",
            "\n ",
            "\nArtemis Consulting uses eVerify to verify employment eligibility.    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive with full benefits!"
    },
    {
        "url": "https://washingtondc.craigslist.org/nva/sof/d/programmers-all-levels-of-experience/6851527884.html",
        "title": "Programmers (all levels of experience)",
        "date": "2019-03-27 09:56",
        "description": [
            "\n        ",
            "\n*** DO NOT APPLY UNTIL YOU HAVE READ THE INSTRUCTIONS BELOW ***",
            "\n",
            "\nWe are a small consulting company located in Northern Virginia. We are looking to add to our growing team a hard working and motivated individual. This is a technical position involving full stack, web and mobile programming. Strong communications skills required. ",
            "\n",
            "\nSome technologies this position will become involved in include C#, Oracle, MSSQL, HTML, Javascript, Hadoop, Machine Learning, AWS, Selenium and others.",
            "\n",
            "\nThis full time position is 95% telecommute and contingent on a 3 month trial period.",
            "\n",
            "\nThis is an excellent learning opportunity as you will be exposed to a wide array of technologies. Compensation is dependent on experience.  Minimal experience, bachelors degree or 1 year of IT related work is required. Also required is some level of hobby or professional experience in programming, along with strong communications skills.",
            "\n",
            "\n**** Your cover letter is more important that your resume! ****",
            "\n",
            "\nRespond via email with your resume and include a cover letter that addresses your abilities in these areas:",
            "\n-\tExperience with programming either as a professional, student, or hobbyist.",
            "\n-\tExperience with databases either as a professional, student, or hobbyist.",
            "\n-\tCommunications and writing skills",
            "\n-\tOrganizational skills    "
        ],
        "employment_type": "full-time",
        "compensation_type": "Competitive and negotiable depending on experience"
    }
]